{
    "0.0.3": {
        "info": {
            "author": "TotvsLabs",
            "author_email": "info@totvslabs.com",
            "bugtrack_url": null,
            "classifiers": [],
            "description": "# Fulfillment Helper\n\nEste app tem como objetivo ser um ponto de partida para a migração de códigos implementados em snippts de fulfillment para uma APi externa. Abaixo as motivações para realizar essa migração.\n\n- A funcionalidade de fulfillment, apesar de facilitar o tratamento de lógicas simplificadas, apresenta várias limitações, dentre elas:\n\n\t+ A edição de código ocorre apenas na GUI oferecida pela plataforma. Isso dificulta a modularização e reúso de código, além de limitar o teste do código. Outro ponto é que a validação do código executada pelo backend é demasiadamente simples, deixando passar inconsistências que seriam capturadas por uma IDE mais robusta.\n\n\t+ O versionamento realizado atraves do backend é do tipo \"caixa preta\", ou seja, é possível salvar versões de implementação contudo não é possível realizar comparações\n\tentre as versões salvas. Esse ponto dificulta o debug e o acompanhamento da evolução da implementação. Com o código implementado externamente qualquer ferramenta de versionamento pode ser usada, como o github, inclusive com a maior controle de publicação (pull requests) e publicações automáticas (CI/CD).\n\n\t+ Com a implementação embedada não há a possibilidade de seguir o paradigma Test Driven Development, pois não há como implementar testes unitários e integrados. \n\n\t+ O resultado processamento de uma conversa só pode ser testado / debugado via chat de conversa. \n\n- Pelos problemas apontados acima, a funcionalidade de implementações de fulfillment via código embedado deve ser descontinuada em um futuro próximo, restando apenas a opção de uso de fulfillment através de webhooks.\n\nO app está organizado da seguinte forma, visando exigir o mínimo de mudanças no código embedado para rodar no app:\n\n- **/app/businesslogic/FullfillmentBase.py**: É a classe base da qual todas as implementações fulfillments devem herdar.\n- **/app/businesslogic/reusable**: Neste diretõrio devem ser colocados todos os códigos recorrentes da implementação.\n- **/app/businesslogic**: Nesta pasta de devem ser colocados os arquivos que implementam as lógicas de negócio de cada nó. As regras são: 1. Deve haver um arquivo por código de fulfillment; 2. O arquivo deve ter como nome o mesmo nome do nó de conversa, com todas as letras minúsculas e espaços substituídos por \"_\"; 3. A implentação deve ser feita via classe extendendo o código da classe FulfillmentBase. O nome da classe deve ser igual o nome do arquivo, porém com o prefíxo \"Fulfillment_\".\n- **/app/auth_helper.py**: Funções auxiliares para efetuar a autenticação das chamadas a esta API.\n- **/app/routes.py**: Código que trata dinâmicamente as chamadas na rota /getanswer, designando o código a ser executado pelo nome do nó.\n\n## Migrando o código\n\nPara exemplificar a migração, tomamos como exemplo a migração do nó *Default Fallback* do projeto Carolina Suporte. Para este caso o criamos o arquivo default_fallback.py no diretório app/businesslogic, com o seguinte conteúdo:\n\n```python\n\nfrom app.businesslogic.FulfillmentBase import FulfillmentBase\nfrom app.businesslogic.reusable.cloudsql_functions import GetMessage\nimport re\nimport random\n\n# Herdando a classe base e implementando o método runFulfillment como código customizado\nclass Fulfillment_default_fallback(FulfillmentBase):\n    def runFulfillment(self):\n\n\t\t# Por padrão, as variáveis disponíveis no fulfillment embedado como variáveis globais são disponibilizadas\n\t\t# aqui como membros de classe. Para evitar ter que acrescentar \"self.\" em todas as referências às variáveis\n\t\t# globais, simplesmente atribuímos a referência da variável de classe a uma variável local. Variáveis comple\n\t\t# xas serão tratadas por referência (alterações modificam o class member), variáveis simples por valor (não \n\t\t# modificam o class member)\n        parameters = self.parameters\n        query = self.query\n        \n\t\t# Iniciando a implementação da lógica de negócio. o Código abaixo foi copiado as-is do código embedado, ajus-\n\t\t# tando apenas a identação.\n\t\tparameters['question'] = query\n        language = parameters.get(\"lang\")\n        module = parameters.get('module')\n        product = parameters.get('product')\n        parameters['subject'] = 'Produto'\n\n        language = \"pt-BR\" if language is None else language \n\n\t\t# Continuação da lógica de negócio suprimida. Código completo disponível em app/businesslogic.\n\t\t...\n\n\t\t# Retornando os resultados para o backend da assistente. Os mesmos parâmetros usados no Fulfillment embedado\n\t\t# podem ser usados aqui também. A única diferença é que retornamos como um dicionário, e não como os objetos\n\t\t# do tipo textResponse e optionResponse. Para mais informações sobre os parâmetros disponíveis consulte:\n\t\t# https://tdn.totvs.com/pages/releaseview.action?pageId=682036247\n\t\t#\n\t\t# Alterações dos parâmetros e variáveis globais do código são automáticamente atualizadas com\n\t\t# os valores adicionados as variáveis de classe do objeto.\n\n\t\tretd = {'message':msg,  'short_message':msg_short,  'jump_to':jump_to,  'custom_log':None}\n        return retd\n```\n\nUma vez adicionado o código fonte, a API já estará apta a tratar o processamento do nó \"Default Fallback\" através da chamada de webhook.",
            "description_content_type": "text/markdown",
            "docs_url": null,
            "download_url": "",
            "downloads": {
                "last_day": -1,
                "last_month": -1,
                "last_week": -1
            },
            "home_page": "https://github.com/totvslabs/assistant-fulfillment-helper",
            "keywords": "assistant fulfillment helper carol totvs carolina carolapp",
            "license": "",
            "maintainer": "",
            "maintainer_email": "",
            "name": "assistant-fulfillment-helper",
            "package_url": "https://pypi.org/project/assistant-fulfillment-helper/",
            "platform": null,
            "project_url": "https://pypi.org/project/assistant-fulfillment-helper/",
            "project_urls": {
                "Homepage": "https://github.com/totvslabs/assistant-fulfillment-helper"
            },
            "release_url": "https://pypi.org/project/assistant-fulfillment-helper/0.0.3/",
            "requires_dist": null,
            "requires_python": ">=3.7",
            "summary": "Assistant Fulfillment Helper Server",
            "version": "0.0.3",
            "yanked": false,
            "yanked_reason": null
        },
        "last_serial": 16201183,
        "urls": [
            {
                "comment_text": "",
                "digests": {
                    "md5": "ad53c11d2b04a610d56acdbccfbd913d",
                    "sha256": "e7f359323cda92633f7987fb778c608c5a8a9ea07292faf15bd8c4e44edf8103"
                },
                "downloads": -1,
                "filename": "assistant-fulfillment-helper-0.0.3.tar.gz",
                "has_sig": false,
                "md5_digest": "ad53c11d2b04a610d56acdbccfbd913d",
                "packagetype": "sdist",
                "python_version": "source",
                "requires_python": ">=3.7",
                "size": 11482,
                "upload_time": "2022-12-23T23:11:09",
                "upload_time_iso_8601": "2022-12-23T23:11:09.701263Z",
                "url": "https://files.pythonhosted.org/packages/4b/39/782ea082510725546fad67d2abed9e1f0bedb53c07fbae8b0967ac9167fb/assistant-fulfillment-helper-0.0.3.tar.gz",
                "yanked": false,
                "yanked_reason": null
            }
        ],
        "vulnerabilities": []
    }
}