{
    "0.0.1": {
        "info": {
            "author": "Example Author",
            "author_email": "author@example.com",
            "bugtrack_url": null,
            "classifiers": [
                "License :: OSI Approved :: MIT License",
                "Operating System :: OS Independent",
                "Programming Language :: Python :: 3"
            ],
            "description": "# *Esta página está DESATUALIZADA!!!*\n# [CLIQUE AQUI PARA CONHECER O NOVO SITE DA FINAWELL](https://bit.ly/3vp8bsq)\n\n# Finawell Site Oficial!\n\nSó **clicar no link acima** que você será *redirecionado* para o **site oficial do Finawell**!\n\n## ELIMINE GORDURA E REDUZA MEDIDAS\n\n**O Finawell emagrecedor mais potente do mercado**\n\n- Elimine excesso de peso sem efeitos colaterais\n- Reduza medidas da barriga, pernas e braços\n- Desintoxique o organismo reduzindo o inchaço\n- Queime carboidratos e gorduras de forma eficaz\n\n## Finawell Funciona Mesmo? Finawell é bom? Finawell é confiável?\n\nMuitas pessoas perguntam se Finawell é bom para secar a gordura de modo saudável e a resposta é SIM. Finawell funciona mesmo, para todos os tipos de pessoas, sem problema algum.\n\nFINAWELL é um composto de vitaminas muito utilizado como auxiliador para perder medidas de todo corpo com uma formula totalmente Natural e livre de danos colaterais.\n\nSeu principal componente é o Picolinato de Cromo, mineral utilizado como acelerados da queima de carboidratos no organismo e que atua junto com outros componentes da fórmula do Finawell para eliminação do peso corporal bem como manutenção no novo peso alcançado.\n\nAlém de tudo Finawell é confiável, pois ajuda a acelerar o metabolismo e a saciar a fome e suas vitaminas agem diretamente pela corrente sanguínea auxiliando o bom funcionamento físico e ajudando o corpo a Emagrecer sem abrir mão da saúde.\n\n## Finawell Composição\n\nFINAWELL é uma fórmula desenvolvida nos Estados Unidos, que ganhou repercussão em programas de TV de emagrecimento.\n\nA composição de Finawell contém:\n\n- Picolinato de cromo (composto principal)\n- Chá verde\n- Cafeína\n- Citrus aurantium\n- Gengibre\n\nJuntos eles formam um excelente time para o emagrecimento rápido e saudável.\n\n## CONHEÇA ALGUNS DOS SEGREDOS DE FINAWELL QUE FAZEM DELE UM SUCESSO!\n\nFINAWELL CONTÉM ELEMENTOS NUTRICIONAIS FUNDAMENTAIS PARA A PERTA E MANUTENÇÃO DO PESO ENDO O PRINCIPAL DELES O PICOLINATO DE CROMO QUE É RECONHECIDO MUNDIALMENTE COMO UM POTENTE ACELERADOR DA QUEIMA DO CARBOIDRATO NO ORGANISMO.\n\n### PICOLINATO DE CROMO:\n\nCromo é um mineral essencial e, atualmente, conhecido por auxiliar a diminuição da formação de colesterol e melhora de quadros de diabetes tipo 2 devido à sua ativa participação no metabolismo diminuindo carboidratos e aumentando a tolerância à glicose, ou seja, diminuindo a vontade de ingerir açúcar.\n\n### TIAMINA:\n\nA principal função da tiamina é sua ação no metabolismo. Ela ajuda o organismo a utilizar com eficiência carboidratos, gorduras, proteínas, glicose, os ácidos graxos e aminoácidos, impossibilitando que essas substâncias prejudiquem o funcionamento do seu corpo.\n\n### RIBOFLAVINA:\n\nÉ importante para o organismo porque participa de funções como: estimular a produção de sangue, mantém o metabolismo adequado, aumenta a produção de energia no corpo e mantém o bom funcionamento do sistema nervoso.\n\n### NIACINA:\n\nAjuda no fornecimento de energia a partir da conversão dos macronutrientes (carboidratos, proteínas e gorduras) ingeridos no dia-a-dia. A niacina destaca-se por ser precursora de duas coenzimas essenciais: NAD+/NADH e NADP+/NADPH.\n\n### VITAMINA B12:\n\nA vitamina B12 ajuda diretamente na oxigenação do corpo a partir da produção de hemácias e também favorece a saúde dos neurônios. Por isso, ela é responsável por auxiliar na melhora do condicionamento físico dos seres humanos.\n\n### SELÊNIO:\n\nO selênio ajuda a prevenir o hipotireoidismo (doenças que deixam o metabolismo mais lento). Além disso, o excesso de peso aumenta a inflamação no organismo, o que desregula também a produção de hormônios da saciedade. Assim, por atuar como anti-inflamatório e antioxidante, o selênio também ajuda a reduzir as alterações hormonais ligadas ao excesso de gordura, o que favorece o emagrecimento.\n\n### ÁCIDO PANTOTÊNICO:\n\nA vitamina B5, também chamada de ácido pantotênico, desempenha funções no corpo como produzir hormônios e hemácias, que são as células que carregam o oxigênio no sangue. É uma vitamina que ajuda a controlar a capacidade de resposta do corpo ao estresse. Auxilia também na conversão de lipídios, carboidratos e proteínas em energia.\n\n![Anvisa](https://www.finawell.com.br/wp-content/uploads/2020/10/anvisa-1.png)\n\nFinawell é regulamentado nos termos da RDC 240 de 26/07/2018, sendo dispensado de registro na anvisa, pois é avaliado como 100% Seguro para o consumo da população.\n\n![100% natural](https://www.finawell.com.br/wp-content/uploads/2020/10/icone_natural-1.png)\n\nTodos os Componentes da Fórmula Finawell são 100% Naturais, sendo liberado para o uso sem preocupações como irritação e alergias, garantindo assim mais segurança.\n\n![Produto original](https://www.finawell.com.br/wp-content/uploads/2020/10/proibido-1.png)\n\nA venda do Finawell através de qualquer outro site está PROIBIDA e pode colocar a sua SAÚDE EM RISCO. Garanta um produto de qualidade comprando APENAS através deste site oficial.\n\n## Finawell Antes e Depois!\n\n**QUEM COMPROU E USOU, APROVOU!**\n\n**Mais de 127 mil pessoas tomaram o Finawell no Brasil.\nNós nos Orgulhamos da nossa taxa de 97,6% de satisfação de nossos clientes.**\n\nVeja abaixo alguns **\"antes e depois\"** do produto *Finawell* para comprovação de que o Finawell emagrecedor realmente funciona:\n\n![antes e depois 1](https://www.finawell.com.br/wp-content/uploads/2020/10/testemunho01.jpg)\n![antes e depois 2](https://www.finawell.com.br/wp-content/uploads/2021/02/testemunho057.jpg)\n![antes e depois 3](https://www.finawell.com.br/wp-content/uploads/2021/06/testemunhos-prov.jpg)\n![antes e depois 4](https://www.finawell.com.br/wp-content/uploads/2020/10/testemunho04.jpg)\n\n**O PRÓXIMO RESULTADO PODE SER O SEU!**\n\n## Finawell Valor: Quanto custa o Finawell?\n\nTemos 3 kits disponíveis no momento:\n\n1. 1 Pote (para Eliminar até 8kg de gordura) - R$ 99,00 ou 12x de R$ 9,94\n2. 4 Potes (para Eliminar até 20kg de gordura) - R$ 99,00 ou 12x de R$ 9,94\n3. 8 Potes (para Eliminar até 35kg de gordura) - R$ 299,00 ou 12x de R$ 30,02\n\nO segundo kit conta com uma promoção incrível no valor do Finawell, pois você poderá levar 4 potes pelo preço de 1. *Isso mesmo!*\n\n## Finawell Reclame Aqui\n\nPodemos dizer que há uma ou outra reclamação sobre o produto Finawell no site Reclame Aqui. Investigando mais a fundo, decobrimos que as reclamações são 100% falsas, vindas de indivíduos aleatórios que supostamente são pagos por concorrentes no mercado para dar falsos depoimentos.\n\nPois, como já visto acima através de fotos de pessoas comuns e reais e também da influencer Ana Andrade, Finawell funciona mesmo.\n\n## ESTÁ COM DÚVIDA QUANTO A COMPRAR PELA INTERNET?\n\n*Não se preocupe! Nós garantimos a segurança da sua compra, este site é protegido.*\n\n- Dados pessoais sigilosos não são compartilhados\n- Dados financeiros guardados sem compartilhamentos\n- 100% confiável compre com segurança\n- Entrega garantida no prazo e política de devolução\n\n\n",
            "description_content_type": "text/markdown",
            "docs_url": null,
            "download_url": "",
            "downloads": {
                "last_day": -1,
                "last_month": -1,
                "last_week": -1
            },
            "home_page": "https://github.com/pypa/sampleproject",
            "keywords": "",
            "license": "",
            "maintainer": "",
            "maintainer_email": "",
            "name": "finawell-funciona-oferta-incrivel-leve-4-pague-1-so-hoje",
            "package_url": "https://pypi.org/project/finawell-funciona-oferta-incrivel-leve-4-pague-1-so-hoje/",
            "platform": "",
            "project_url": "https://pypi.org/project/finawell-funciona-oferta-incrivel-leve-4-pague-1-so-hoje/",
            "project_urls": {
                "Bug Tracker": "https://github.com/pypa/sampleproject/issues",
                "Homepage": "https://github.com/pypa/sampleproject"
            },
            "release_url": "https://pypi.org/project/finawell-funciona-oferta-incrivel-leve-4-pague-1-so-hoje/0.0.1/",
            "requires_dist": null,
            "requires_python": ">=3.6",
            "summary": "Finawell funciona? Promoção Hoje: Leve 4 potes pelo preço de 1! Garantia de 90 dias! Veja fotos do Finalwell Antes e Depois. Confira Já, só Hoje!",
            "version": "0.0.1",
            "yanked": false,
            "yanked_reason": null
        },
        "last_serial": 10654278,
        "urls": [
            {
                "comment_text": "",
                "digests": {
                    "md5": "95cbd769a9ce5771b28460e7753eb64a",
                    "sha256": "3c7822aab709825f0964c58bb0208b14da6360aa342979731ae4985332df1520"
                },
                "downloads": -1,
                "filename": "finawell_funciona_oferta_incrivel_leve_4_pague_1_so_hoje-0.0.1-py3-none-any.whl",
                "has_sig": false,
                "md5_digest": "95cbd769a9ce5771b28460e7753eb64a",
                "packagetype": "bdist_wheel",
                "python_version": "py3",
                "requires_python": ">=3.6",
                "size": 6200,
                "upload_time": "2021-06-15T16:06:59",
                "upload_time_iso_8601": "2021-06-15T16:06:59.628533Z",
                "url": "https://files.pythonhosted.org/packages/78/99/3aeba8a39ec3cbb9cbcd021ddc2e545a900be2ef73b6da9c7569cb37e9d5/finawell_funciona_oferta_incrivel_leve_4_pague_1_so_hoje-0.0.1-py3-none-any.whl",
                "yanked": false,
                "yanked_reason": null
            },
            {
                "comment_text": "",
                "digests": {
                    "md5": "0ef56c14c35ea25ef58bf81092ef20fd",
                    "sha256": "e126d4d06c75d9a12e9b26e6028f6e930c8d4b7a00752623371bcbd22b9c9ab4"
                },
                "downloads": -1,
                "filename": "finawell-funciona-oferta-incrivel-leve-4-pague-1-so-hoje-0.0.1.tar.gz",
                "has_sig": false,
                "md5_digest": "0ef56c14c35ea25ef58bf81092ef20fd",
                "packagetype": "sdist",
                "python_version": "source",
                "requires_python": ">=3.6",
                "size": 5712,
                "upload_time": "2021-06-15T16:07:00",
                "upload_time_iso_8601": "2021-06-15T16:07:00.766648Z",
                "url": "https://files.pythonhosted.org/packages/ca/6d/9356abdd198c41853097d2213e8ba7afba9be08bc94a58cdcc59ea5509ab/finawell-funciona-oferta-incrivel-leve-4-pague-1-so-hoje-0.0.1.tar.gz",
                "yanked": false,
                "yanked_reason": null
            }
        ],
        "vulnerabilities": []
    }
}