{
    "0.1.0": {
        "info": {
            "author": "",
            "author_email": "Jesse Bulson-Lewis <j.bl@posteo.org>",
            "bugtrack_url": null,
            "classifiers": [
                "License :: OSI Approved :: GNU Lesser General Public License v3 (LGPLv3)",
                "Operating System :: OS Independent",
                "Programming Language :: Python :: 3"
            ],
            "description_content_type": "",
            "docs_url": null,
            "download_url": "",
            "downloads": {
                "last_day": -1,
                "last_month": -1,
                "last_week": -1
            },
            "home_page": "",
            "keywords": "",
            "license": "### GNU LESSER GENERAL PUBLIC LICENSE Version 3, 29 June 2007 Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/> Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed. This version of the GNU Lesser General Public License incorporates the terms and conditions of version 3 of the GNU General Public License, supplemented by the additional permissions listed below. #### 0. Additional Definitions. As used herein, \"this License\" refers to version 3 of the GNU Lesser General Public License, and the \"GNU GPL\" refers to version 3 of the GNU General Public License. \"The Library\" refers to a covered work governed by this License, other than an Application or a Combined Work as defined below. An \"Application\" is any work that makes use of an interface provided by the Library, but which is not otherwise based on the Library. Defining a subclass of a class defined by the Library is deemed a mode of using an interface provided by the Library. A \"Combined Work\" is a work produced by combining or linking an Application with the Library. The particular version of the Library with which the Combined Work was made is also called the \"Linked Version\". The \"Minimal Corresponding Source\" for a Combined Work means the Corresponding Source for the Combined Work, excluding any source code for portions of the Combined Work that, considered in isolation, are based on the Application, and not on the Linked Version. The \"Corresponding Application Code\" for a Combined Work means the object code and/or source code for the Application, including any data and utility programs needed for reproducing the Combined Work from the Application, but excluding the System Libraries of the Combined Work. #### 1. Exception to Section 3 of the GNU GPL. You may convey a covered work under sections 3 and 4 of this License without being bound by section 3 of the GNU GPL. #### 2. Conveying Modified Versions. If you modify a copy of the Library, and, in your modifications, a facility refers to a function or data to be supplied by an Application that uses the facility (other than as an argument passed when the facility is invoked), then you may convey a copy of the modified version: -   a) under this License, provided that you make a good faith effort to ensure that, in the event an Application does not supply the function or data, the facility still operates, and performs whatever part of its purpose remains meaningful, or -   b) under the GNU GPL, with none of the additional permissions of this License applicable to that copy. #### 3. Object Code Incorporating Material from Library Header Files. The object code form of an Application may incorporate material from a header file that is part of the Library. You may convey such object code under terms of your choice, provided that, if the incorporated material is not limited to numerical parameters, data structure layouts and accessors, or small macros, inline functions and templates (ten or fewer lines in length), you do both of the following: -   a) Give prominent notice with each copy of the object code that the Library is used in it and that the Library and its use are covered by this License. -   b) Accompany the object code with a copy of the GNU GPL and this license document. #### 4. Combined Works. You may convey a Combined Work under terms of your choice that, taken together, effectively do not restrict modification of the portions of the Library contained in the Combined Work and reverse engineering for debugging such modifications, if you also do each of the following: -   a) Give prominent notice with each copy of the Combined Work that the Library is used in it and that the Library and its use are covered by this License. -   b) Accompany the Combined Work with a copy of the GNU GPL and this license document. -   c) For a Combined Work that displays copyright notices during execution, include the copyright notice for the Library among these notices, as well as a reference directing the user to the copies of the GNU GPL and this license document. -   d) Do one of the following: -   0) Convey the Minimal Corresponding Source under the terms of this License, and the Corresponding Application Code in a form suitable for, and under terms that permit, the user to recombine or relink the Application with a modified version of the Linked Version to produce a modified Combined Work, in the manner specified by section 6 of the GNU GPL for conveying Corresponding Source. -   1) Use a suitable shared library mechanism for linking with the Library. A suitable mechanism is one that (a) uses at run time a copy of the Library already present on the user's computer system, and (b) will operate properly with a modified version of the Library that is interface-compatible with the Linked Version. -   e) Provide Installation Information, but only if you would otherwise be required to provide such information under section 6 of the GNU GPL, and only to the extent that such information is necessary to install and execute a modified version of the Combined Work produced by recombining or relinking the Application with a modified version of the Linked Version. (If you use option 4d0, the Installation Information must accompany the Minimal Corresponding Source and Corresponding Application Code. If you use option 4d1, you must provide the Installation Information in the manner specified by section 6 of the GNU GPL for conveying Corresponding Source.) #### 5. Combined Libraries. You may place library facilities that are a work based on the Library side by side in a single library together with other library facilities that are not Applications and are not covered by this License, and convey such a combined library under terms of your choice, if you do both of the following: -   a) Accompany the combined library with a copy of the same work based on the Library, uncombined with any other library facilities, conveyed under the terms of this License. -   b) Give prominent notice with the combined library that part of it is a work based on the Library, and explaining where to find the accompanying uncombined form of the same work. #### 6. Revised Versions of the GNU Lesser General Public License. The Free Software Foundation may publish revised and/or new versions of the GNU Lesser General Public License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns. Each version is given a distinguishing version number. If the Library as you received it specifies that a certain numbered version of the GNU Lesser General Public License \"or any later version\" applies to it, you have the option of following the terms and conditions either of that published version or of any later version published by the Free Software Foundation. If the Library as you received it does not specify a version number of the GNU Lesser General Public License, you may choose any version of the GNU Lesser General Public License ever published by the Free Software Foundation. If the Library as you received it specifies that a proxy can decide whether future versions of the GNU Lesser General Public License shall apply, that proxy's public statement of acceptance of any version is permanent authorization for you to choose that version for the Library.",
            "maintainer": "",
            "maintainer_email": "",
            "name": "wordhash",
            "package_url": "https://pypi.org/project/wordhash/",
            "platform": null,
            "project_url": "https://pypi.org/project/wordhash/",
            "project_urls": null,
            "release_url": "https://pypi.org/project/wordhash/0.1.0/",
            "requires_dist": [
                "bitstring"
            ],
            "requires_python": ">=3.6",
            "summary": "Get a unique string of words for type of data",
            "version": "0.1.0",
            "yanked": false,
            "yanked_reason": null
        },
        "last_serial": 14991118,
        "urls": [
            {
                "comment_text": "",
                "digests": {
                    "md5": "b4b6b992662bf8fb6c35d53d1230766e",
                    "sha256": "b94b2e4b2fd63dd99be9fd3262046f0dcc4fb3574f4fe46febffd9a74e18d157"
                },
                "downloads": -1,
                "filename": "wordhash-0.1.0-py3-none-any.whl",
                "has_sig": false,
                "md5_digest": "b4b6b992662bf8fb6c35d53d1230766e",
                "packagetype": "bdist_wheel",
                "python_version": "py3",
                "requires_python": ">=3.6",
                "size": 31502,
                "upload_time": "2022-09-04T22:13:56",
                "upload_time_iso_8601": "2022-09-04T22:13:56.636278Z",
                "url": "https://files.pythonhosted.org/packages/d9/3c/f25f17166d8ff03cfe18858881e5011426eba1ede1d2f94a86191b58a45d/wordhash-0.1.0-py3-none-any.whl",
                "yanked": false,
                "yanked_reason": null
            },
            {
                "comment_text": "",
                "digests": {
                    "md5": "2043bced273cdb0263a07711f119c74d",
                    "sha256": "c68edb30029a1a9db4373076cf240bcdf0b7516f1e4a1e28f6ca61b068b2783b"
                },
                "downloads": -1,
                "filename": "wordhash-0.1.0.tar.gz",
                "has_sig": false,
                "md5_digest": "2043bced273cdb0263a07711f119c74d",
                "packagetype": "sdist",
                "python_version": "source",
                "requires_python": ">=3.6",
                "size": 33001,
                "upload_time": "2022-09-04T22:13:58",
                "upload_time_iso_8601": "2022-09-04T22:13:58.963842Z",
                "url": "https://files.pythonhosted.org/packages/30/26/41f9b350e6e3bdf794ecf18ccc1391eb6934f43b44cdfe79be64a113b8a4/wordhash-0.1.0.tar.gz",
                "yanked": false,
                "yanked_reason": null
            }
        ],
        "vulnerabilities": []
    },
    "0.1.1": {
        "info": {
            "author": "",
            "author_email": "Jesse Bulson-Lewis <j.bl@posteo.org>",
            "bugtrack_url": null,
            "classifiers": [
                "License :: OSI Approved :: GNU Lesser General Public License v3 (LGPLv3)",
                "Operating System :: OS Independent",
                "Programming Language :: Python :: 3"
            ],
            "description": "# wordhash\n\nThis project provides a command-line tool and a Python library to do this:\n\nGiven some arbitrary input data, output a fingerprint of that data in the form\nof a string of ordinary English words. If the input data changes even slightly,\nthen the output will change completely.\n\nIt uses the [EFF's large wordlist](https://www.eff.org/document/passphrase-wordlists)\nas a source of words.\n\n## Installation\n\n```\npip install wordhash\n```\n\n## Usage\n\n### Command-line interface (CLI)\n\n```bash\n$ wordhash -h\nusage: wordhash [-h] [-w WORDLIST_PATH] [-l LENGTH]\n                (-f FILE | -s STRING)\n\noptions:\n  -h, --help            show this help message and exit\n  -w WORDLIST_PATH, --wordlist WORDLIST_PATH\n                        Path to a newline-delimted file containing\n                        words to be used in the wordhash (default:\n                        venv/lib64/python3.10/site-\n                        packages/wordhash/data/wordlist.txt)\n  -l LENGTH, --length LENGTH\n                        Length of hash digest for this program to use\n                        internally. Determines number of words in the\n                        resulting wordhash. (default: 8)\n  -f FILE, --file FILE  Path to file to use as input data (default:\n                        None)\n  -s STRING, --string STRING\n                        String to use as input data (default: None)\n$ wordhash -s 'the quick brown fox jumps over the lazy dog'\nBackstabAuthenticDialDivingModifiedAbridge\n$ echo -n 'the quick brown fox jumps over the lazy dog' > test.tx\nt\n$ wordhash -f test.txt \nBackstabAuthenticDialDivingModifiedAbridge\n```\n\n### Python library\n\n```python\n>>> import wordhash\n>>> mydata = b'the quick brown fox jumps over the lazy dog'\n>>> wordhash.wordhash(mydata)\n'BackstabAuthenticDialDivingModifiedAbridge'\n```\n",
            "description_content_type": "text/markdown",
            "docs_url": null,
            "download_url": "",
            "downloads": {
                "last_day": -1,
                "last_month": -1,
                "last_week": -1
            },
            "home_page": "",
            "keywords": "",
            "license": "LGPLv3",
            "maintainer": "",
            "maintainer_email": "",
            "name": "wordhash",
            "package_url": "https://pypi.org/project/wordhash/",
            "platform": null,
            "project_url": "https://pypi.org/project/wordhash/",
            "project_urls": {
                "Homepage": "https://github.com/jessebl/wordhash"
            },
            "release_url": "https://pypi.org/project/wordhash/0.1.1/",
            "requires_dist": [
                "bitstring"
            ],
            "requires_python": ">=3.6",
            "summary": "Get a string of English words as a fingerprint of any input data",
            "version": "0.1.1",
            "yanked": false,
            "yanked_reason": null
        },
        "last_serial": 14991118,
        "urls": [
            {
                "comment_text": "",
                "digests": {
                    "md5": "3fad41d2b6ebe68484fdf71060291ec2",
                    "sha256": "71baa3c2194476ea250b08d73fdee43258a19eceadccf90ca55a6f0335556d6d"
                },
                "downloads": -1,
                "filename": "wordhash-0.1.1-py3-none-any.whl",
                "has_sig": false,
                "md5_digest": "3fad41d2b6ebe68484fdf71060291ec2",
                "packagetype": "bdist_wheel",
                "python_version": "py3",
                "requires_python": ">=3.6",
                "size": 55907,
                "upload_time": "2022-09-05T00:01:44",
                "upload_time_iso_8601": "2022-09-05T00:01:44.776711Z",
                "url": "https://files.pythonhosted.org/packages/d5/f6/86655ba6c09d5f86a84d7e861519bb55c96d74d0de3942af69a58f0a94ba/wordhash-0.1.1-py3-none-any.whl",
                "yanked": false,
                "yanked_reason": null
            },
            {
                "comment_text": "",
                "digests": {
                    "md5": "b54539534aba2836e72ebf1d35620bc3",
                    "sha256": "98bdef6025ceb46c7aae8d72a40c61919650b818794cb69b4bbea5109c988b2b"
                },
                "downloads": -1,
                "filename": "wordhash-0.1.1.tar.gz",
                "has_sig": false,
                "md5_digest": "b54539534aba2836e72ebf1d35620bc3",
                "packagetype": "sdist",
                "python_version": "source",
                "requires_python": ">=3.6",
                "size": 32612,
                "upload_time": "2022-09-05T00:01:47",
                "upload_time_iso_8601": "2022-09-05T00:01:47.040889Z",
                "url": "https://files.pythonhosted.org/packages/60/45/ab6ee7309cd060d6cb66396cd0987f12254699c5ca48dd555bac3d75af3a/wordhash-0.1.1.tar.gz",
                "yanked": false,
                "yanked_reason": null
            }
        ],
        "vulnerabilities": []
    }
}