{
    "2.0.0": {
        "info": {
            "author": "",
            "author_email": "Jaakko Pasanen <jaakko.o.pasanen@gmail.com>",
            "bugtrack_url": null,
            "classifiers": [
                "License :: OSI Approved :: MIT License",
                "Operating System :: OS Independent",
                "Programming Language :: Python :: 3"
            ],
            "description": "# AutoEQ\n**TL;DR** If you are here just looking to make your headphones sound better, find your headphone model in\n[results](./results) folder's recommended headphones list\nand follow instructions in [Usage](#usage) section.\n\n## About This Project\nAutoEQ is a project for equalizing headphone frequency responses automatically, and it achieves this by parsing\nfrequency response measurements and producing equalization settings which correct the headphone to a neutral sound.\nThis project currently has over 4000 headphones covered in the\n[results](./results) folder.\nSee [Usage](#usage) for instructions how to use the results with\ndifferent equalizer softwares and\n[Results](#results) section for details about parameters and how the results were\nobtained.\n\nAutoEQ is not just a collection of automatically produced headphone equalization settings but also a tool for equalizing\nheadphones for yourself. `autoeq.py` provides methods for reading data, equalizing it to a given target\nresponse and saving the results for usage with equalizers. It's possible to use different compensation (target)\ncurves, apply tilt for making the headphones brighter/darker and adding a bass boost. It's even possible to make one\nheadphone sound (roughly) like another headphone. For more info about equalizing see [Equalizing](#equalizing). If\nyou're looking for something light weight to install as a dependency for your own project, you'll find\n[autoeq-pkg](https://github.com/jaakkopasanen/autoeq-pkg) much more suited for your needs.\n\nThird major contribution of this project is the measurement data and compensation curves all in a numerical format\nexcept for Crinacle's raw data. Everything is stored as CSV files so they are easy to process with any programming\nlanguage or even Excel.\n\n![Sennheiser HD 800](./results/oratory1990/harman_over-ear_2018/Sennheiser%20HD%20800/Sennheiser%20HD%20800.png)\n\n*Sennheiser HD 800 equalization results plotted*\n\n### Updates\n**2022-10-30** Restructured the project and published in PyPi. Source code moved under [autoeq](./autoeq) directory and \ncommand line usage changed from `python autoeq.py` to `python -m autoeq` with underscores `_` replaced with hyphens `-`\nin the parameter names. \n\n**2022-09-18** Parametric eq optimizer reworked. The new optimizer supports shelf filters, has a powerful configuration\nsystem, run 10x faster, has limits for Fc, Q and gain value ranges and treats +10 kHz range as average value instead of\ntrying to fix it precisely.\n\n## Usage\nAutoEQ produces settings for basically all types of equalizer apps.\n\n### Convolution Equalizers\nConvolution equalizer is the most powerful type of equalizer software. These equalizers allow extremly precise control\nover the frequency response and the results are the same on all devices and platforms when using the same FIR filter.\nConvolution equalizer is the preferred way to use AutoEq results.\n\nAutoEq supports convolution equalizers with FIR filters as WAV files and with EqualizerAPO's GraphicEQ filter type. The\ndefault results contain FIR filters for both 44.1 kHz and 48 kHz sampling rates. Other sampling rates are supported but\nnot given in the default results. EqualizerAPO's GraphicEQ works with any sampling rate.\n\nTo use the FIR filters, download the appropriate WAV file and import it to the EQ software of your choice. Please keep\nin mind that not all EQ softwares support convolution. Some equalizers can load multiple FIR filters at the same time.\nDownload both WAV files, create a Zip file containing both and load the Zip file to for example Roon.\n\nSee [EqualizerApo](#EqualizerAPO) for instructions on how to use the GraphicEQ.\n\n### Parametric Equalizers\nParametric equalizers have filters (bands) with user adjustable gain, center frequency and quality Q. Keep in mind that\nparametric eq accuracy depends on the number of filters available. Usually 10 filters produce very good\nresults but as little as 5 can be good enough. Keep in mind that different parametric equalizers will produce different\noutcomes with the same parameter values. Parameters produced by AutoEq are equal with EqualizerAPO using 44.1 kHz\nsampling rate. When using other equalizers or sampling rates, it's always highly recommended to check that the frequency\nresponse of the equalizer matches the parametric eq curve in the graphs.\n\nAll parametric equalizer except Peace require you to configure the filter parameters manually with the software user\ninterface. Some parametric equalizer use filter width (band width) instead of Q. Filter width can be calculated as:\n`bw = Fc / Q` where `bw` is the band width in Herts, `Fc` is center frequency and `Q` is quality. Filter width in\noctaves can be calculated as: `N = ln(1 + 1/(2*Q^2) + sqrt(((2*Q^2 + 1) / Q^2 )^2 / 4 - 1)) / ln(2)` where `ln` is the\nnatural logarithm. See http://www.sengpielaudio.com/calculator-bandwidth.htm for an online calculator.\n\nIt's very important to set preamp according to the value given in the result README.md document. Parametric eq filters\nwill produce positive gains and to avoid clipping a preamp with negative gain is required.\n\nParametric eq settings can be used with Peace or any other parametric eq which has at least 5 bands available. Even\nfewer bands is possible but pre-computed results require you to use at least the five first of the filters.\nParametric equalizer filter parameters look like this:\n\n| Type     | Fc      | Q    | Gain    |\n| :------- | :------ | :--- | :------ |\n| LowShelf | 105 Hz  | 0.70 | 6.3 dB  |\n| Peaking  | 162 Hz  | 0.91 | -2.3 dB |\n| Peaking  | 2237 Hz | 1.94 | -4.6 dB |\n| Peaking  | 6093 Hz | 2.26 | -4.7 dB |\n| Peaking  | 8251 Hz | 3.71 | -2.9 dB |\n\n### Fixed Band Equalizers\nFixed band eq is more commonly known as graphic equalizer but in order not to confuse with EqualizerAPO GraphicEQ it is\ncalled like that in this project. Fixed band equalizer is like parametric equalizer with several peaking filters but\ndon't have adjustable frequency information, only gain. All other types are preferred over fixed band equalizers but on\nsome devices these are the only available ones.\n\nFixed band equalizers have trouble compensating for narrow notches and peaks that fall between two bands. Good example\nis [Sennheiser HD 800](./results/oratory1990/harman_over-ear_2018/Sennheiser%20HD%20800)\nwith it's 6 kHz peak that is right in between 4 kHz and 8 kHz bands of standard 10-band equalizer.\nWhen using 10-band equalizer check if the fixed band equalization curve is very different than the desired equalization\ncurve at some frequency and adjust the nearby filters by ear for best results.\n\nFixed band equalizer settings look like this:\n\n| Type    | Fc       | Q    | Gain    |\n| :------ | :------- | :--- | :------ |\n| Peaking | 31 Hz    | 1.41 | 6.1 dB  |\n| Peaking | 62 Hz    | 1.41 | 3.0 dB  |\n| Peaking | 125 Hz   | 1.41 | -1.1 dB |\n| Peaking | 250 Hz   | 1.41 | -2.2 dB |\n| Peaking | 500 Hz   | 1.41 | -0.9 dB |\n| Peaking | 1000 Hz  | 1.41 | 0.1 dB  |\n| Peaking | 2000 Hz  | 1.41 | 3.6 dB  |\n| Peaking | 4000 Hz  | 1.41 | -1.0 dB |\n| Peaking | 8000 Hz  | 1.41 | -4.1 dB |\n| Peaking | 16000 Hz | 1.41 | -7.5 dB |\n\n### Windows\nhas [EqualizerAPO](#equalizerapo), [Peace](#peace) and many media players with parametric equalizers such as\n[Neutron](https://www.microsoft.com/en-us/p/neutron-music-player/9nblggh4vp2h?activetab=pivot:overviewtab),\n[Roon](https://roonlabs.com/) and [Foobar2000](https://www.foobar2000.org/).\n\n#### EqualizerAPO\nIt's possible to use plain [EqualizerAPO](https://sourceforge.net/projects/equalizerapo/) and edit configuration file in\n`C:\\Program Files\\EqualizerAPO\\config\\config.txt`. Replace contents of the file with the GraphicEQ.txt file found in\nresults. Preamp is not needed because it is incorporated into the GraphicEQ line. Using\n[Sennheiser HD 650](./results/oratory1990/harman_over-ear_2018/Sennheiser%20HD%20650)\nwould make config file look like this:\n```\nGraphicEQ: 20 -0.5; 21 -0.5; 22 -0.5; 23 -0.5; 24 -0.5; 26 -0.5; 27 -0.5; 29 -0.5; 30 -0.5; 32 -0.9; 34 -1.2; 36 -1.5; 38 -1.8; 40 -2.1; 43 -2.4; 45 -2.4; 48 -2.5; 50 -2.6; 53 -3.0; 56 -3.2; 59 -3.3; 63 -3.6; 66 -4.0; 70 -4.5; 74 -5.0; 78 -5.5; 83 -5.9; 87 -6.3; 92 -6.7; 97 -7.0; 103 -7.3; 109 -7.6; 115 -7.8; 121 -8.0; 128 -8.1; 136 -8.4; 143 -8.6; 151 -8.7; 160 -8.8; 169 -8.8; 178 -8.9; 188 -8.9; 199 -9.0; 210 -9.0; 222 -9.0; 235 -8.9; 248 -8.8; 262 -8.6; 277 -8.5; 292 -8.4; 309 -8.3; 326 -8.2; 345 -8.1; 364 -7.9; 385 -7.8; 406 -7.7; 429 -7.6; 453 -7.6; 479 -7.5; 506 -7.4; 534 -7.2; 565 -7.1; 596 -7.0; 630 -7.0; 665 -7.0; 703 -7.0; 743 -7.0; 784 -7.1; 829 -7.1; 875 -7.1; 924 -7.0; 977 -7.1; 1032 -7.2; 1090 -7.3; 1151 -7.2; 1216 -7.0; 1284 -6.9; 1357 -6.7; 1433 -6.4; 1514 -6.2; 1599 -6.1; 1689 -5.9; 1784 -5.6; 1885 -5.4; 1991 -5.2; 2103 -5.1; 2221 -5.2; 2347 -5.5; 2479 -5.8; 2618 -6.2; 2766 -6.6; 2921 -6.9; 3086 -7.0; 3260 -6.8; 3443 -6.2; 3637 -5.6; 3842 -5.1; 4058 -4.6; 4287 -4.2; 4528 -4.2; 4783 -4.8; 5052 -5.2; 5337 -4.8; 5637 -4.3; 5955 -4.7; 6290 -4.9; 6644 -4.7; 7018 -4.8; 7414 -5.7; 7831 -6.3; 8272 -6.5; 8738 -6.5; 9230 -6.5; 9749 -6.5; 10298 -6.5; 10878 -6.5; 11490 -6.5; 12137 -6.5; 12821 -7.8; 13543 -9.9; 14305 -9.7; 15110 -9.0; 15961 -11.0; 16860 -13.5; 17809 -14.5; 18812 -15.2; 19871 -15.7\n```\n\nEqualizerAPO has a graphical user interface for adjusting configurations. Launch the editor from\n`C:\\Program Files\\EqualizerAPO\\Editor.exe`.\n\n![equalizerapo-editor](https://i.imgur.com/lHhRBuA.png)\n\n*EqualizerAPO Editor GUI*\n\n#### Peace\n[Peace](https://sourceforge.net/projects/peace-equalizer-apo-extension/) is a GUI for manipulating parametric eq filters\nwith EqualizerAPO. Peace also has visualization for the end result equalization frequency response, profile manager for\nmultiple different eq settings and a switch for disabling everything among other features. Load eq settings into Peace\nby clicking *Import* button and select the *<model> ParametricEQ.txt* file. Set the preamp to value mentioned in the\nresults.\n\n![peace](https://i.imgur.com/e0POEbF.png)\n\n*Peace with full GUI for EqualizerAPO*\n\n### Android\nAndroid has several different equalizer options but not too many powerful apps which work with all apps. Wavelet is the best\noption for newer Androids (version 9 and up) but older devices have a built-in fixed band equalizer which works system wide\nbut the center frequencies and Q values vary so might need to [produce your own results](#equalizing).\n\n#### Wavelet\n[Wavelet](https://play.google.com/store/apps/details?id=com.pittvandewitt.wavelet) is an Android app which comes with\nall the AutoEq eq profiles built in. The app works with all music apps so is closest to system-wide equalizer one can\nhave on Android without rooting. The equalizer built into this app is very powerful and can represent the AutoEq\nprofiles very accurately. There is also an option to tune the sound with graphic equalizer. Wavelet has the best\nBluetooth device compatibility of all the tested eq apps on Android.\n\nThe main functionalities of Wavelet are free (including AutoEq profiles and graphic eq) but some extra features can be\nunlocked with an in-app purchase.\n\n![Wavelet](https://i.imgur.com/UGiBwFX.png)\n\n#### Neutron\n[Neutron](https://play.google.com/store/apps/details?id=com.neutroncode.mp) is a music player with parametric equalizer\nand comes with all of the AutoEq profiles built in but is not free.\n\n#### USB Audio Player PRO\n[USB Audio Player PRO](https://play.google.com/store/apps/details?id=com.extreamsd.usbaudioplayerpro) is an Android app\nwith improved USB audio drivers for usage with USB DACs. USB Audio Player\nPRO is not system-wide but works with local files and many streaming services though not with Spotify. USB Audio Player\nhas Toneboosters Morphit plugin which has parametric equalizer. This app and the plugin are not free.\n\n#### Music EQ Equalizer\nThe best app for system wide equalization on older Android phones (without rooting) is\n[Music Equalizer EQ](https://play.google.com/store/apps/details?id=mediam.music.equalizer) which is a 10-band standard\nequalizer. Gains for each band can be adjusted with only 1 dB resolution but this isn't a problem because the average\nerror is then only 0.25 dB, hardly noticeable. Bigger problem is the potential narrow peaks and notches between the\nbands' center frequencies since there isn't really anything that can be done for those. See notes about\n[fixed band equalizers](#fixed-band-equalizers).\n\nThe app starts in the presets view so you need to click the left arrow in the top left corner to get to the manual view. Here you\ncan adjust the bands. Set each band level to the closest value to what the equalization settings ask. Pre-computed results\nonly support standard 10-band equalizers which have band center frequencies at 31, 63, 125, 250, 500, 1000, 2000, 4000,\n8000 and 16000 Hz. Q values are not adjustable so you don't have to worry about those even though they are given in the\nresult settings.\n\n#### Viper4Android\n[Viper4Android](https://forum.xda-developers.com/showthread.php?t=2191223) is a system-wide\nconvolution based equalizer (and much more) on Android but it requires rooting of the device. Viper4Android is supported\nwith impulse response (WAV) files. For rooted users this is the best option.\n\n#### JamesDSP\n[JamesDSP](https://forum.xda-developers.com/android/apps-games/app-reformed-dsp-manager-t3607970) is an alternative to\nViper4Android. It provides a system wide solution, has a convolution engine but requires rooting.\n\n### Linux\n#### PulseEffects / EasyEffects\n[PulseEffects / EasyEffects](https://github.com/wwmm/easyeffects) is a Linux module with wide variety of signal\nprocessing tools including convolution and parametric equalizers.\n\nFrom version 4.7.2 onwards PulseEffects added support for convolution FIR filters. This is the recommended way to apply\nAutoEq presets. Navigate to the plugins tab and add the convolver plugin, then click the waveform button above the stereo width controls (or just the 'Impulses' button as of 6.1.x), click \"Import impulse\" and select the AutoEq\ngenerated WAV file. You may also need to manually click 'load' in the Impulses menu for the filter to be fully loaded. PulseEffects' convolver requires you to set the input gain to prevent clipping. The gain required\nby parametric eq should be sufficient, maybe 0.5 dB of negative gain more. Depending on the version, you may need to\nrename the `.wav` file as `.irs`.\n\nTo use parametric eq, from version 6.0.0 onwards, first select the `plugins` tab at\nthe bottom of the screen, add the equalizer plugin, and load APO settings by clicking \"Load APO Preset\" and\nselecting the ParametricEQ.txt file. For EasyEffects <= 6.1.3, Pre-amp can be adjusted with the input slider.\nLater versions support reading this from ParametricEQ.txt.\n\nFrom version 5.0.0 onwards, PulseEffects was renamed to EasyEffects and uses PipeWire instead of PulseAudio as backend.\nLoad eq settings by clicking the top center cog & clicking *Import ACO Presets* button and select the ParametricEQ.txt\nfile.  Pre-amp can be adjusted with the input slider.\n\nFor versions prior to v4.8.0, adjust filter parameters by clicking the cog button on each filter\nand set type to \"Bell\", mode to \"APO\" and adjust the gain with the slider. Number of filters can be changed by clicking\nthe screwdriver and wrench button.\n\n![pulseeffects](https://user-images.githubusercontent.com/32952512/112381638-6cd3b280-8d08-11eb-844a-b83600c6c02a.png)\n\n### OSX / MacOS\nSystem wide parametric EQ solutions on OSX typically rely on separate plugin hosting software and the actual plugin\nwhich does the actual equalization.\n\nPardon the lack of documentation for these. I have not tested any of the methods myself but they have been suggested by\nhelpful AutoEQ users.\n\n[SoundSource](https://rogueamoeba.com/soundsource/) is the easiest way to use AutoEq on Mac since it comes with all of the\nprofiles built in. The software is however not free.\n\nAudio plugin hosts include:\n- Apple's own [AU Lab](https://www.apple.com/apple-music/apple-digital-masters/) hosts AU plugins and can be used as a system-wide audio output via [BlackHole](https://github.com/ExistentialAudio/BlackHole) or [Soundflower](https://github.com/mattingalls/Soundflower).\n- [MenuBus](https://www.menubus.audio/versions) has a free version but is no longer actively developed.\n- [Hosting AU](http://ju-x.com/hostingau.html) with [BlackHole](https://github.com/ExistentialAudio/BlackHole) or\n[Soundflower](https://github.com/mattingalls/Soundflower) can be used as a system wide AU plugin host.\n\nEQ plugins include:\n- [Voxengo PrimeEQ](https://www.voxengo.com/product/primeeq/) is a parametric EQ plugin but is not free.\n- [Fabfilter Pro Q3](https://www.fabfilter.com/products/pro-q-3-equalizer-plug-in) is another parametric EQ plugin, more\nexpensive than Voxengo but might be easier to install and use. Note: Pro Q3 uses a different system and all Q values need to be multiplied by 1.41!\n- [LAConvolver plugin](http://audio.lernvall.com/) is a free convolver EQ which works with impulse response WAV files.\n- AUNBandEq comes built in with Mac OSX. Works at least with HostingAU + BlackHole\n\n![hostingau+blackhole](https://user-images.githubusercontent.com/38220377/71527191-9706ac80-28da-11ea-8f70-88caf57c4821.png)\n\nTutorials:\n- [Apple AU Lab + Soundflower + AUNBandEQ Tutorial](https://www.superbestaudiofriends.org/index.php?threads/systemwide-eq-on-mac.7435/) [AU Lab Permission Issue](https://discussions.apple.com/thread/8552731)\n\n#### eqMac\n[eqMac](https://eqmac.app) is a Free & [Open Source](https://github.com/bitgapp/eqmac) System Wide equalizer for macOS.\neqMac has a Free 10 Band EQ and an Unlimited Band EQ (paid) with built-in AutoEQ Integration! (Expert EQ)\n<p align=\"center\">\n  <img width=\"512\" src=\"https://raw.githubusercontent.com/bitgapp/eqMac/master/assets/screenshots/autoeq-promo.png\"/>\n</p>\n\n### iOS\niOS unfortunately doesn't allow system-wide equalizers, so the only options are either music players with built-in\nequalizer or [hardware solutions](#Hardware).\n\n#### Neutron\n[Neutron](https://apps.apple.com/app/neutron-music-player/id766858884) is a music player with parametric equalizer and\ncomes with all of the AutoEq profiles built in but is not free.\n\n#### EQE\n[EQE](https://github.com/rweichler/EQE) is a system wide parametric equalizer on iOS but requires jailbreaking. Here\nare instructions on how to set it up: https://www.reddit.com/r/headphones/comments/dqbt81/psa_if_you_have_a_jailbroken_iphone_you_can/\n\n### Hardware\nSome devices have built-in equalizers and since they do the processing in the device, they work with any source which\ncan connect to the device.\n\n[Qudelix 5K](https://www.qudelix.com/products/qudelix-5k-dac-amp) is a portable DAC and amplifier\nwith wired and Bluetooth connectivity and 10 band parametric equalizer.\n\n[Radsone EasStudio ES100](https://www.radsone.com/earstudio) is a Bluetooth DAC and amp with built-in 10 band\nequalizer. Since this is a hardware solution it will work with\npractically any source.\n\n## Equalizing\n`autoeq.py` is the tool used to produce the equalization results from measurement data. There is no\nfancy graphical user interface but instead it is used from command line.\n\n### Installing\n- Download and install Git: https://git-scm.com/downloads. When installing Git on Windows, use Windows SSL verification\ninstead of Open SSL or you might run into problems when installing project dependencies.\n- Download and install 64-bit **[Python 3.10](https://www.python.org/getit/)**. Make sure to check *Add Python 3.10 to PATH*.\n- You may need to install [libsndfile](http://www.mega-nerd.com/libsndfile/) if you're having problems with `soundfile`\nwhen installing `requirements.txt`.\n- On Linux you may need to install Python dev packages\n```shell\nsudo apt install python3-dev python3-pip python3-venv\n```\n- On Linux you may need to install [pip](https://pip.pypa.io/en/stable/installing/)\n- On Windows you may need to install\n[Microsoft Visual C++ Redistributable for Visual Studio 2015, 2017, and 2019](https://support.microsoft.com/en-us/help/2977003/the-latest-supported-visual-c-downloads)\n- Open a terminal / command prompt. On Windows, search `cmd` in the start menu.\n- Clone AutoEq\n```shell\ngit clone https://github.com/jaakkopasanen/AutoEq.git\n```\n- Go to AutoEq location\n```shell\ncd AutoEq\n```\n- Check Python version. You should see Python 3.10.x printed out. If you see for example 3.11.x, you need to install Python **3.10**.\n```shell\npython --version\n```\n- Create a python virtual environment\n```shell\npython -m venv venv\n```\n- Activate virtualenv\n```shell\n# On Windows\nvenv\\Scripts\\activate.bat\n# On Linux and Mac\n. venv/bin/activate\n```\n- Update pip\n```shell\npython -m pip install -U pip\n```\n- Install required packages\n```shell\npython -m pip install -U -e .\n```\n- Verify installation. If everything went well, you'll see the list of command line parameters AutoEq accepts.\n```shell\npython -m autoeq --help\n```\n\nWhen coming back at a later time you'll only need to activate virtual environment again\n```shell\n# On Windows\ncd AutoEq\nvenv\\Scripts\\activate.bat\n# On Linux and Mac\ncd AutoEq\n. venv/bin/activate\n```\n\nTo learn more about virtual environments, read [Python' venv documentation](https://docs.python.org/3.8/library/venv.html).\n\n#### Updating\nAutoEq is in active development and gets new measurements, results and features all the time. You can get the latest\nversion from git\n```shell\ngit pull\n```\n\nDependencies may change from time to time, you can update to the latest with\n```shell\npython -m pip install -U -e .\n```\n\n### Command Line Usage\n```\nusage: __main__.py [-h] --input-dir INPUT_DIR --output-dir OUTPUT_DIR [--standardize-input] [--new-only] [--compensation COMPENSATION] [--equalize] [--parametric-eq] [--fixed-band-eq] [--rockbox] [--ten-band-eq] [--parametric-eq-config PARAMETRIC_EQ_CONFIG] [--fixed-band-eq-config FIXED_BAND_EQ_CONFIG] [--convolution-eq]\n                   [--fs FS] [--bit-depth BIT_DEPTH] [--phase PHASE] [--f-res F_RES] [--bass-boost BASS_BOOST] [--tilt TILT] [--sound-signature SOUND_SIGNATURE] [--max-gain MAX_GAIN] [--window-size WINDOW_SIZE] [--treble-window-size TREBLE_WINDOW_SIZE] [--treble-f-lower TREBLE_F_LOWER] [--treble-f-upper TREBLE_F_UPPER]\n                   [--treble-gain-k TREBLE_GAIN_K] [--thread-count THREAD_COUNT]\n\noptions:\n  -h, --help            show this help message and exit\n  --input-dir INPUT_DIR\n                        Path to input data directory. Will look for CSV files in the data directory and recursively in sub-directories.\n  --output-dir OUTPUT_DIR\n                        Path to results directory. Will keep the same relative paths for files found in input-dir.\n  --standardize-input   Overwrite input data in standardized sampling and bias?\n  --new-only            Only process input files which don't have results in output directory.\n  --compensation COMPENSATION\n                        File path to CSV containing compensation (target) curve. Compensation is necessary when equalizing because all input data is raw microphone data. See \"compensation\", \"innerfidelity/resources\" and \"headphonecom/resources\".\n  --equalize            Will run equalization if this parameter exists, no value needed.\n  --parametric-eq       Will produce parametric eq settings if this parameter exists, no value needed.\n  --fixed-band-eq       Will produce fixed band eq settings if this parameter exists, no value needed.\n  --rockbox             Will produce a Rockbox .cfg file with 10 band eq settings if this parameter exists,no value needed.\n  --ten-band-eq         Shortcut parameter for activating standard ten band eq optimization.\n  --parametric-eq-config PARAMETRIC_EQ_CONFIG\n                        Name of parametric equalizer configuration or a path to a configuration file. Available named configurations are \"10_PEAKING\" for 10 peaking filters, \"8_PEAKING_WITH_SHELVES\" for 8 peaking filters and a low shelf at 105 Hz for bass adjustment and a high shelf at 10 kHz for treble adjustment,\n                        \"4_PEAKING_WITH_LOW_SHELF\" for 4 peaking filters and a low shelf at 105 Hz for bass adjustment, \"4_PEAKING_WITH_HIGH_SHELF\" for 4 peaking filters and a high shelf at 10 kHz for treble adjustments. You can give multiple named configurations by separating the names with commas and filter sets will be\n                        built on top of each other. When the value is a file path, the file will be read and used as a configuration. The file needs to be a YAML file with \"filters\" field as a list of filter configurations, each of which can define \"fc\", \"min_fc\", \"max_fc\", \"q\", \"min_q\", \"max_q\", \"gain\", \"min_gain\",\n                        \"max_gain\" and \"type\" fields. When the fc, q or gain value is given, the parameter won't be optimized for the filter. \"type\" needs to be either \"LOW_SHELF\", \"PEAKING\" or \"HIGH_SHELF\". Also \"filter_defaults\" field is supported on the top level and it can have the same fields as the filters do. All\n                        fields missing from the filters will be read from \"filter_defaults\". Defaults to \"4_PEAKING_WITH_LOW_SHELF,4_PEAKING_WITH_HIGH_SHELF\". Optimizer behavior can be adjusted by defining \"optimizer\" field which has fields \"min_f\" and \"max_f\" for lower and upper bounds of the optimization range, \"max_time\"\n                        for maximum optimization duration in seconds, \"target_loss\" for RMSE target level upon reaching which the optimization is ended, \"min_change_rate\" for minimum rate of improvement in db/s and \"min_std\" for minimum standard deviation of the last few loss values. \"min_change_rate\" and \"min_std\" end the\n                        optimization when further time spent optimizing can't be expected to improve the results dramatically. See peq.yaml for an example.\n  --fixed-band-eq-config FIXED_BAND_EQ_CONFIG\n                        Path to fixed band equalizer configuration. The file format is the same YAML as for parametric equalizer.\n  --convolution-eq      Will produce impulse response for convolution equalizers if this parameter exists, no value needed.\n  --fs FS               Sampling frequency in Hertz for impulse response and parametric eq filters. Single value or multiple values separated by commas eg 44100,48000. When multiple values are given only the first one will be used for parametric eq. Defaults to 44100.\n  --bit-depth BIT_DEPTH\n                        Number of bits for every sample in impulse response. Defaults to 16.\n  --phase PHASE         Impulse response phase characteristic. \"minimum\", \"linear\" or \"both\". Defaults to \"minimum\"\n  --f-res F_RES         Frequency resolution for impulse responses. If this is 20 then impulse response frequency domain will be sampled every 20 Hz. Filter length for impulse responses will be fs/f_res. Defaults to 10.\n  --bass-boost BASS_BOOST\n                        Bass boost shelf. Sub-bass frequencies will be boosted by this amount. Can be either a single value for a gain in dB or a comma separated list of three values for parameters of a low shelf filter, where the first is gain in dB, second is center frequency (Fc) in Hz and the last is quality (Q). When\n                        only a single value (gain) is given, default values for Fc and Q are used which are 105.0 Hz and 0.7, respectively. For example \"--bass-boost=6\" or \"--bass-boost=9.5,150,0.6\".\n  --tilt TILT           Target tilt in dB/octave. Positive value (upwards slope) will result in brighter frequency response and negative value (downwards slope) will result in darker frequency response. 1 dB/octave will produce nearly 10 dB difference in desired value between 20 Hz and 20 kHz. Tilt is applied with bass boost\n                        and both will affect the bass gain.\n  --sound-signature SOUND_SIGNATURE\n                        File path to a sound signature CSV file. Sound signature is added to the compensation curve. Error data will be used as the sound signature target if the CSV file contains an error column and otherwise the raw column will be used. This means there are two different options for using sound signature:\n                        1st is pointing it to a result CSV file of a previous run and the 2nd is to create a CSV file with just frequency and raw columns by hand (or other means). The Sound signature graph will be interpolated so any number of point at any frequencies will do, making it easy to create simple signatures with\n                        as little as two or three points.\n  --max-gain MAX_GAIN   Maximum positive gain in equalization. Higher max gain allows to equalize deeper dips in frequency response but will limit output volume if no analog gain is available because positive gain requires negative digital preamp equal to maximum positive gain. Defaults to 6.0.\n  --window-size WINDOW_SIZE\n                        Smoothing window size in octaves.\n  --treble-window-size TREBLE_WINDOW_SIZE\n                        Smoothing window size in octaves in the treble region.\n  --treble-f-lower TREBLE_F_LOWER\n                        Lower bound for transition region between normal and treble frequencies. Treble frequencies can have different max gain and gain K. Defaults to 6000.0.\n  --treble-f-upper TREBLE_F_UPPER\n                        Upper bound for transition region between normal and treble frequencies. Treble frequencies can have different max gain and gain K. Defaults to 8000.0.\n  --treble-gain-k TREBLE_GAIN_K\n                        Coefficient for treble gain, affects both positive and negative gain. Useful for disabling or reducing equalization power in treble region. Defaults to 1.0.\n  --thread-count THREAD_COUNT\n                        Amount of threads to use for processing results. If set to \"max\" all the threads available will be used. Using more threads result in higher memory usage. Defaults to 1.\n```\n\n\n### Examples\n\n#### Reproducing Results\nReproducing pre-computed results for oratory1990 measured on-ear headphones:\n```shell\npython -m autoeq --input-dir=\"measurements/oratory1990/data/onear\" --output-dir=\"my_results/oratory1990/harman_over-ear_2018\" --compensation=\"compensation/harman_over-ear_2018_wo_bass.csv\" --parametric-eq --parametric-eq-config=8_PEAKING_WITH_SHELVES --ten-band-eq --bass-boost=4.0 --convolution-eq --fs=44100,48000\n```\n\nReproducing pre-computed results for Rtings measured IEMs:\n```shell\npython -m autoeq --input-dir=\"measurements/rtings/data/inear\" --output-dir=\"my_results/rtings/avg\" --compensation=\"measurements/rtings/resources/rtings_compensation_avg.csv\" --parametric-eq --parametric-eq-config=8_PEAKING_WITH_SHELVES --ten-band-eq --bass-boost=6.0 --convolution-eq --fs=44100,48000\n```\n\nAll parameters used for pre-computed results can be found in the `results/update.py` script.\n\n#### Equalizing Individual Headphones\nEqualizing Sennheiser HD 650 and saving results to `my_results/HD650`:\n```shell\npython -m autoeq --input-dir=\"measurements/innerfidelity/data/onear/Sennheiser HD 650\" --output-dir=\"my_results/HD650\" --compensation=\"measurements/innerfidelity/resources/innerfidelity_harman_over-ear_2018_wo_bass.csv\" --bass-boost=4 --convolution-eq --fs=44100,48000\n```\n\n#### Fixed Band Equalizers\nFixed band equalizer settings can be produced the same way as parametric eq. Create `fbeq.yaml` with contents\n```yaml\nfilter_defaults:\n  type: PEAKING\n  q: 1.05\nfilters:\n  - fc: 400\n  - fc: 1000\n  - fc: 2500\n  - fc: 6300\n  - fc: 16000\n```\nto optimize for Sony WH-1000XM3 app.\n```shell\npython -m autoeq --input-dir=\"measurements/oratory1990/data/onear/Sony WH-1000XM3\" --output-dir=\"my_results/Sony WH-1000XM3 (app)\" --compensation=\"compensation/harman_over-ear_2018_wo_bass.csv\" --bass-boost=4.0 --fixed-band-eq --fixed-band-eq-config=fbeq.yaml\n```\n\n#### Using Sound Signatures\nAutoEQ provides a way to play around with different sound signatures easily. The use-cases include making headphones\ndeviate from the neutral target or making one headphone sound like another.\n\nEqualizing Sennheiser HD 800 to sound like Sennheiser HD 650 using pre-computed results. Both have been measured by\noratory1990 so we'll use those measurements. Pre-computed results include 4dB of bass boost for over-ear headphones and\ntherefore we need to apply a bass boost of 4dB here as well.\n```shell\npython -m autoeq --input-dir=\"measurements/oratory1990/data/onear/Sennheiser HD 800\" --output-dir=\"my_results/Sennheiser HD 800 (HD 650)\" --compensation=\"compensation/harman_over-ear_2018_wo_bass.csv\" --sound-signature=\"results/oratory1990/harman_over-ear_2018/Sennheiser HD 650/Sennheiser HD 650.csv\" --parametric-eq --parametric-eq-config=8_PEAKING_WITH_SHELVES --ten-band-eq --bass-boost=4 --convolution-eq --fs=44100,48000\n```\n\nEqualizing Massdrop x Sennheiser HD 800 to sound like AKG K701. There is no K701 measurement made by oratory1990 so\nwe'll use Innerfidelity's measurement for the sound signature. The list of recommended results always points to best\nmeasurement so you can check there which one to use (measurement system can be found in the URL).\n```shell\npython -m autoeq --input-dir=\"measurements/oratory1990/data/onear/Sennheiser HD 800\" --output-dir=\"my_results/Sennheiser HD 800 (K701)\" --compensation=\"compensation/harman_over-ear_2018_wo_bass.csv\" --sound-signature=\"results/innerfidelity/innerfidelity_harman_over-ear_2018/AKG K701/AKG K701.csv\" --parametric-eq --parametric-eq-config=8_PEAKING_WITH_SHELVES --ten-band-eq --bass-boost=4 --convolution-eq --fs=44100,48000\n```\n\nEqualizing HiFiMAN HE400S to sound like Massdrop x Meze 99 Noir. HE400S is measured only by Innerfidelity so we'll point\ncompensation file pointing to Innerfidelity's calibrated Harman target. Meze 99 Noir has massive natural bass boost and\nto capture that we need to relax max gain to +12dB.\n```shell\npython -m autoeq --input-dir=\"measurements/innerfidelity/data/onear/HiFiMAN HE400S\" --output-dir=\"my_results/HE400S (99 Noir)\" --compensation=\"measurements/innerfidelity/resources/innerfidelity_harman_over-ear_2018_wo_bass.csv\" --sound-signature=\"results/oratory1990/harman_over-ear_2018/Meze 99 Noir/Meze 99 Noir.csv\" --parametric-eq --parametric-eq-config=8_PEAKING_WITH_SHELVES --ten-band-eq --bass-boost=4 --max_gain=8\n```\n\nApplying V-shaped sound signature to Audeze Mobius. First step is to create the sound signature file. Save this to\n`my_data/v.csv`:\n```csv\nfrequency,raw\n20,4.0\n1000,-4.0\n10000,4.0\n20000,0.0\n```\nThen use it by providing the path to `--sound-signature` parameter. We'll set bass boost to 0dB because the sound\nsignature already has a significant bass boost. Of course it's possible to add bass boost on top of the sound signature\nfile if you want even more bass.\n```shell\npython -m autoeq --input-dir=\"measurements/rtings/data/onear/Audeze Mobius\" --output-dir=\"my_results/Audeze Mobius (V-signature)\" --compensation=\"measurements/rtings/resources/rtings_compensation_avg.csv\" --sound-signature=\"my_data/v.csv\" --parametric-eq --parametric-eq-config=8_PEAKING_WITH_SHELVES --ten-band-eq --bass-boost=4.0\n```\n\n## Results\nThe main principle used by AutoEQ for producing the equalization function is to invert the error curve. Error is the\ndifference between raw microphone data and the compensation (target) curve. If headphone's frequency response is 4 dB\nbelow the target at 20 Hz equalization function will have +4 dB boost at 20 Hz. In reality simply inverting the error is\nnot sufficient since measurements and equalization have several problems that need to be addressed, see\n[Technical Challenges](#technical-challenges) for more details.\n\nResults provided in this project currently have all the headphone measurements from\n- [Crinacle](https://crinacle.com/)\n- [Headphone.com](http://graphs.headphone.com/)\n- [Innerfidelity](https://www.innerfidelity.com/headphone-measurements)\n- [oratory1990](https://www.reddit.com/r/oratory1990)\n- [Reference Audio Analyzer](https://reference-audio-analyzer.pro/en/catalog-reports.php?sp_1=1&tp=1)\n- [Rtings](https://www.rtings.com/headphones)\nwith the exception of Reference Audio Analyzer measurements done on the SF1 system.\n\nResults are organized by `source/target/headphone` so a Sennheiser HD 650 measured by Innerfidelity and tuned to a\ncalibrated Harman target would be found in\n[innerfidelity/innerfidelity_harman_over-ear_2018/Sennheiser HD 650](./results/innerfidelity/innerfidelity_harman_over-ear_2018/Sennheiser%20HD%20650).\nMultiple measurements of the same headphone by the same measurement entity are averaged. All different measurements for\naveraging have been renamed with snXXX (serial number) or sample X in the end of the name to distinguish from the\naveraged data which has no suffixes in the name.\n\noratory1990 measurements have been done on Gras 43AG and 43AC couplers, the same which were used to develop Harman\ntarget responses by Olive et al. and therefore use Harman target responses for the equalization targets. These results\nare recommended over all other measurements because of this reason. Harman target data is in the `compensation` folder.\n\nCrinacle's in-ear measurements have been performed with IEC 60318-4 coupler and are therefore compatible with\nHarman in-ear targets. This fact also earns Crinacle's measurements second highest ranking recommendation after\noratory1990. Crinacle's over-ear measurements use the same ear simulator attached to a MiniDSP ears pinna. The\nmeasurements done on this system are not as accurate as oratory1990's but because of the high quality ear simulator,\nthese are a bit better than rest.\n\nInnerfidelity, Rtings and Headphone.com measurements have been performed on Head Acoustics HMSII.3 measurement system.\nThis system is not an industry standard anymore because of the rigid pinnae. The Headphone.com measurements are the old\nones which are no longer available. These are not to be consfused with the new measurements Resolve is producing using\nGRAS system.\n\nReference Audio Analyzer have [three different measurement systems](https://reference-audio-analyzer.pro/en/stands.php)\nnone of which seem to represent human hearing particularly well. The most recent HDM-X system is close to the Head\nAcoustics HMSII.3 systems but seems to suffer a bit more in the bass range. HDM1 is clearly worse than other systems\nand the measurements done on the SF1 system are not included at all because that is a flat plate coupler. IEM measurements\nare done with what looks like a tubing coupler and these don't look very accurate. Reference Audio Analyzer\nmeasurements and results are a last resort.\n\nAll of the results use frequency response targets that were specifically developed for this project except oratory1990\nand Crinacle's IEM measurements which use standard Harman targets. The target curves were developed by calibrating\nmeasurements against reference measurements by oratory1990 and Crinacle (IEMs) and modifying the Harman 2018 over-ear\nand 2019 in-ear targets with the calibration data.\n\nNone of these targets have bass boost seen in Harman target responses and therefore a +4dB boost was applied for all\nover-ear headphones, +6dB for in-ear headphones and no boost for earbuds. Harman targets actually ask for about +6dB for\nover-ears and +9dB for in-ears but since some headphones cannot achieve this with positive gain limited to +6dB, a\nsmaller boost was selected. Above 6 to 12 kHz data is filtered more heavily to avoid equalizing the narrow dips and\nnotches that depend heavily on the listener's own ears.\n\n### oratory1990 IEM Target\nIn-ear results with oratory1990 target (formerly \"Usound\" target) are not longer given because the new 2019 Harman\nin-ear fixes the +10 kHz problems of the 2017 target. Also it is easy to transform results created for Harman 2019 to\noratory1990 target without running the processing yourself if you are using parametric equalizer and have two filters\n(bands) available by adding these two to your eq software:\n\n| Type    | Fc   | Q    | Gain |\n| :------ | :--- | :--- | :--- |\n| Peaking | 113  | 0.75 | 3.5  |\n| Peaking | 3766 | 0.63 | -2.3 |\n\nThe results will be remarkably similar to results produced with the actual oratory1990 target:\n\n![oratory1990 vs Harman in-ear 2019](https://i.imgur.com/kGYBOev.png)\n\nOf course it's still possible to produce native results with oratory1990 target by pointing compensation to the\noratory1990 target file: `--compensation=\"compensation/oratory1990.csv` or\n`--compensation=\"compensation/oratory1990_wo_bass.csv`\n\n### Innerfidelity Target by Super Best Audio Friends Forum User \"Serious\"\nInnerfidelity and Headphone.com measured headphones previously used\n[SBAF-Serious target](https://www.superbestaudiofriends.org/index.php?threads/innerfidelity-fr-target.5560/) only.\nThe SBAF-Serious curve is no longer used for these measurements since a new targets were developed by calibrating Harman\ntargets. This is a modified version of Innerfidelity target curve produced by a user called Serious on Super Best Audio\nFriends forum. This curve doesn't have any glaring problems and is quite well balanced overall. Curve was turned into a\ncompensation for raw microphone data and tilted 0.2 dB / octave brighter. Innerfidelity measurements are recommended\nover Headphone.com measurements because SBAF-Serious target was developed for Innerfidelity. SBAF-Serious curve was\nmodified to be suitable for Headphone.com measurements. CSV data files for Innerfidelity and\nHeadphone.com are at `innerfidelity/resources/innerfidelity_compensation_sbaf-serious.csv` and\n`headphonecom/resources/headphonecom_compensation_sbaf-serious.csv`, respectively.\n\n### Rtings Targets\nRtings measured headphones have a frequency response target made for this project. This treble average target is using an\naverage of frequency responses of all Rtings measured headphones in the treble range with small manual reduction of the\n9kHz peak and the Rtings native response below 2500 Hz without bass boost. Three different targets were compared in\nlistening tests and the treble average target was found to sound the best. Other two were the Rtings native target curve\nand calibrated and uncalibrated versions of SBAF Serious target curve. Rtings uses the same measurement system as\nInnerfidelity uses so in theory the uncalibrated SBAF Serious target should work similarly with Rtings but listening\ntests found the treble average target to be slightly better. Rtings have\n[a very informative video](https://www.youtube.com/watch?v=HNEI3qLZEKo) about how they are doing the measurements and\nhow they came up with the target they use.\n\nAll of these Rtings targets retired when new calibrated Harman targets were developed for Rtings measurements.\n\n## Technical Challenges\nSimply inverting headphone frequency response deviation from target response does not usually produce sufficient\nresults. Some problems are caused by imperfections in measurements, some are reliability issues and some are practical\nend-user problems. Rtings has a good [video on Youtube](https://www.youtube.com/watch?v=HNEI3qLZEKo) about measurement\nsystem challenges and solutions which is definitely worth checking out. Innerfidelity also has a very\neducational [video on Youtube](https://www.youtube.com/watch?v=SDRHFNfFCFU) about measurements and what constitutes as a\nneutral sound. Main takeoffs are that bass and treble measurements are very inconsistent, neutral sound is not very well\ndefined yet and on-ear headphones have big reliability problems in 8 to 9kHz range due to resonances which move when\nheadphone placement is changed. Harman international has done some solid research into preferred headphone frequency\nresponse but since that research was done on a different measurement system the target does not apply directly to\nInnerfidelity (Summer 2018) and Headphone.com measurements.\n\nThere is very little that can be done for fighting bass inconsistencies because the same problems will be there whether\nequalization is used or not. Headphones simply have different bass responses on different listeners (heads). Therefore\nbass is taken as is in AutoEQ and equalized as if there was nothing wrong with it. Your mileage may vary. Luckily bass\nhas smaller impact on music and having too much bass (especially sub-bass) doesn't create problems of the same magnitude\nas having too much treble.\n\nMoving resonances around 8 to 9kHz may cause big problems if not taken into account. Spikes and dips in this range are\nof great amplitude and very narrow. If one equalizes these spikes and dips according to frequency response measurement\nin worst case scenario a spike will move in a place of dip when headphone is moved, and therefore the spike is amplified\nsignificantly, leading to a very sharp and piercing sound signature. To counter these problems by default AutoEQ uses heavy\nsmoothing and limited positive gain above 6 to 8kHz. This way the equalization will follow a broader trend of the region\nand will not care so much about narrow spikes and dips. Also positive gain is limited to 0dB as an extra safety measure\nagainst amplifying spikes due to moving the headphone. Suppressing a narrow dip even further is not an optimal thing to do but in practice has\nlittle negative effect on the sound. Both of these measures will also alleviate upper treble measurement inconsistencies\nabove 11 to 12 kHz.\n\nA practical end-user problem is if too high positive gain is allowed which asks for equal amount of negative digital\npre-amp to prevent clipping. This negative preamp will limit maximum volume produced by the system if there is no analog\ngain available. If a dedicated headphone amplifier is available or if the motherboard/soundcard can drive the headphones\nloud enough even when using high negative preamp larger `--max_gain` values can be used. By default `--max_gain` is set\nto +6dB so as not to cripple the user's volume too much. Max gain will clip the equalization curve which produces sharp kinks\nin it. Sharp changes in equalization may produce unwanted equalization artifacts. To counter this AutoEQ rounds the\ncorners whenever max gain clips the curve.\n\n\n## Parametric Equalizer Optimization\nAutoEQ has an optimizer to fit several filters to the desired equalization curve. Optimization is an iterative process\nwhere the filter parameters which provide the best results are searched until optimization finishes or any of the early\nstopping conditions are met.\n\nThe optimizer can be configured quite flexibly. The filter type (peaking, low shelf or high shelf) and minimum and\nmaximum values for center frequency (fc), quality (q) and gain can be set as well as disable optimization for any of\nthese in favor of fixed value. The optimizer itself can be configured to stop the process early when the changes being\nmade are too small, a target error level has been reached or maximum amount of time has been used.\n\n[peq.yaml](./peq.yaml) has an example configuration. Feel free to adjust the file to your needs.\n\nHere's an animation of what happens during the optimization.\n\n![optimization-animation](https://i.imgur.com/3breF6l.gif)\n\n*Optimization of parametric eq filters (click to play again)*\n\nTechnically speaking the optimization is an error minimization process. The error is the root mean squared difference\nbetween the equalization target and the frequency response from the current set of filter parameters. The optimizer\nadjusts the filter parameters multiple times on each iteration to figure out in which direction each should be adjusted\nto decrease the error. In addition to the RMSE between target and current equalizer frequency response, the undesired\ncombination of filter parameters is penalized. Currently that means adding more error if the filter has positive\ngain and too steep slope (as this can cause audible ringing). The additional error (regularization) ensures the\noptimizer doesn't produce these kinds of filter parameter combinations.\n\nThe > 10 kHz frequency range is treated as a single average level because research indicates that the perceived sound\nquality is not sensitive to accurately following a curve above 10 kHz but rather a total energy in the range.\n\n## Contact\n[Issues](https://github.com/jaakkopasanen/AutoEq/issues) are the way to go if you are experiencing problems or have\nideas or feature requests. Issues are not the correct channel for headphone requests because this project sources the\nmeasurements from other databases and a headphone missing from AutoEq means it has not been measured by any of the\nsupported sources.\n\nYou can find me in [Reddit](https://www.reddit.com/user/jaakkopasanen),\n[Audio Science Review](https://www.audiosciencereview.com/forum/index.php?members/jaakkopasanen.17838/) and\n[Head-fi](https://www.head-fi.org/members/jaakkopasanen.491235/) if you just want to say hello.\n",
            "description_content_type": "text/markdown",
            "docs_url": null,
            "download_url": "",
            "downloads": {
                "last_day": -1,
                "last_month": -1,
                "last_week": -1
            },
            "home_page": "",
            "keywords": "",
            "license": "",
            "maintainer": "",
            "maintainer_email": "",
            "name": "autoeq",
            "package_url": "https://pypi.org/project/autoeq/",
            "platform": null,
            "project_url": "https://pypi.org/project/autoeq/",
            "project_urls": {
                "Bug Tracker": "https://github.com/jaakkopasanen/AutoEq/issues",
                "Homepage": "https://github.com/jaakkopasanen/AutoEq"
            },
            "release_url": "https://pypi.org/project/autoeq/2.0.0/",
            "requires_dist": [
                "matplotlib~=3.5.2",
                "numpy~=1.23.1",
                "pandas~=1.4.3",
                "pillow~=9.2.0",
                "pyyaml~=6.0",
                "scipy~=1.8.1",
                "soundfile~=0.10.2",
                "tabulate~=0.8.10",
                "tqdm~=4.64.0"
            ],
            "requires_python": ">=3.7",
            "summary": "Automatic headphone equalizer config generator",
            "version": "2.0.0",
            "yanked": false,
            "yanked_reason": null
        },
        "last_serial": 15586481,
        "urls": [
            {
                "comment_text": "",
                "digests": {
                    "md5": "fc91e024d110f01d882bc9201f3df375",
                    "sha256": "c37a8f74ec6f8cef2b54cfd5145a09cea59faf7411a678ae04fd03c1fcaf9601"
                },
                "downloads": -1,
                "filename": "autoeq-2.0.0-py3-none-any.whl",
                "has_sig": false,
                "md5_digest": "fc91e024d110f01d882bc9201f3df375",
                "packagetype": "bdist_wheel",
                "python_version": "py3",
                "requires_python": ">=3.7",
                "size": 65439,
                "upload_time": "2022-10-30T13:00:51",
                "upload_time_iso_8601": "2022-10-30T13:00:51.148809Z",
                "url": "https://files.pythonhosted.org/packages/19/fd/94f2dba0bbb5164942c0020d5ecdcde3471120c1f53830dd6406f04a5ab8/autoeq-2.0.0-py3-none-any.whl",
                "yanked": false,
                "yanked_reason": null
            },
            {
                "comment_text": "",
                "digests": {
                    "md5": "df618d62bcc4f27ec2259213fd851d9f",
                    "sha256": "3750d3cb952d3b13d90d8e68d4bf22045bf8f57d0f6f39caffd9765a90670c00"
                },
                "downloads": -1,
                "filename": "autoeq-2.0.0.tar.gz",
                "has_sig": false,
                "md5_digest": "df618d62bcc4f27ec2259213fd851d9f",
                "packagetype": "sdist",
                "python_version": "source",
                "requires_python": ">=3.7",
                "size": 61223,
                "upload_time": "2022-10-30T13:00:54",
                "upload_time_iso_8601": "2022-10-30T13:00:54.332747Z",
                "url": "https://files.pythonhosted.org/packages/0c/d6/21007877ab47c192eac6aefe26cde4c2581faca7be6b118c570a4e9607b7/autoeq-2.0.0.tar.gz",
                "yanked": false,
                "yanked_reason": null
            }
        ],
        "vulnerabilities": []
    }
}