{
    "0.0.1": {
        "info": {
            "author": "",
            "author_email": "",
            "bugtrack_url": null,
            "classifiers": [],
            "description": "# USAGE\n\n## Environment\nYou will have to set up the following environment variabl:\n\nexport CMAKE_PREFIX_PATH=\"${installation_directory}/lib/cmake/modena/\n\nfor example:\n\nexport CMAKE_PREFIX_PATH=\"/usr/local/lib/python3.8/dist-packages/modena/lib/cmake/modena/\"\n\n## Workflows\n\nWorkflows have to be defined by the user\n\n\n# MoDeNa in Brief\nA software Framework for *MO*delling of morphology *DE*velopment of\nmicro- and *NA*nostructures\n\nThe [MoDeNa project](http://www.modenaproject.eu/) aims at developing,\ndemonstrating and assessing an easy-to-use multi-scale software\nframework application under an open-source licensing scheme that\ndelivers models with feasible computational loads for process and\nproduct design of complex materials.  The concept of MoDeNa is an\ninterconnected multi-scale software framework. Four scales will be\nlinked together by this framework namely the nano-, micro-, meso-, and\nmacroscale. As application cases we consider polyurethane foams (PU),\nwhich are excellent examples of a large turnover product produced in a\nvariety of qualities and of which the properties are the result of\ndesigning and controlling the material structure on all levels of\nscale, from the molecule to the final product.\n\nMulti-scale coupling requires the exchange of information between\nsoftware instances developed for specific scales in a consistent\nway. In order to achieve this, generating consistent representations\nfor models and data is necessary. The information exchange is governed\nby protocols and may occur in two ways, namely:\n\n- \"forward mapping\" (passing information from the microscopic to the\n    macroscopic scale in upward direction)\n\n- \"backward mapping\" (passing information from the macroscopic to the\n    microscopic scale in downward direction)\n\n\"Forward mapping\" is relatively straightforward, while \"backward\nmapping\" inevitably requires iteration since changing the operating\nconditions at the fine level changes the feedback to the coarse level.\n\"Backward mapping\" can be realised by \"two-way coupling\" or by\n\"fitting surrogate models\". The first approach usually requires\nexchange of large amounts of data during runtime that may be expensive\neither due to the complexity of the data exchange or the computational\ncost associated with executing the microscopic-scale simulation. In\nsuch cases, replacing the microscopic-scale simulation with a\nsurrogate model presents the only viable alternative. This operation\ninherently constitutes a transfer of data across scales and MoDeNa is\nunique in that it focuses on this approach.\n\nA typical operation sequence starts a macroscopic-scale simulation which\ninstantiates one or more surrogate models. When the validity of a model\nis violated, a design of experiment operation is triggered. It creates\ninputs for a set of microscopic-scale simulations. When all experiments\nare finished, the parameter estimation component is invoked which\nupdates the model parameters. Next, the macroscopic-scale simulation is\nrestarted. It should be noted, that the MoDeNa software framework\nsupports application and model dependencies across multiple scales.\n\nThe MoDeNa framework handles the communication across scales through\nrecipes and adapters. Recipes perform simulations by executing\napplications (in-house codes or external software packages such as\nFOAM, Materials Studio, PC-Saft) for a given set of inputs. Adapters\nhandle the communication with the MoDeNa software framework. Both,\nrecipes and adapters are application specific.  Adapters exist as\noutgoing and incoming adapters. Outgoing adapters are relatively\nstraight forward in that they perform a mapping operation (such as\naveraging) and communicate the results. The averaging process may have\nto be started and performed within the application (e.g. for time\naveraging). However, the results can usually be submitted in a\nseparate process after the simulation is finished. Incoming adapters\nare more complicated since they usually require to embed surrogate\nmodels within the applications.\n\nThe software framework consists of an orchestrator, a database and a\ninterface library. The orchestrator is based on\n[FireWorks](http://pythonhosted.org/FireWorks/) and constitutes the\nbackbone of the software framework in that it schedules simulations as\nwell as design of experiments & parameter estimation operations which\nmake up the work-flow of the overall simulation. It is very much like\na dynamic work-flow engine, in which the different applications are\n\"orchestrated\" to obtain information, analyse and pass it to the other\noperations. The NoSQL database [MongoDB](http://www.mongodb.org/) is\nused to store the state of the work-flow as well as the surrogate\nmodels together with associated data such as model parameters, data\nused for parameter estimation, and meta-data.\n\nThe interface library consists of two parts: A high-level python\nmodule providing access to the database as well as design of\nexperiments and regression analysis capabilities by building on\n[MongoEngine](http://www.mongoengine.org) and\n[R](http://www.r-project.org/), respectively. The second part is a\nlow-level library providing unified access to the surrogate\nmodels. This component is written in C to ensure interoperability\nacross platforms and target applications while providing the\ncomputationally efficient model execution required by the\napplications. The library is loaded as a shared library by the\nmacroscopic-scale applications or as a native python extension by the\nhigh-level python module ensuring that all components instantiate\nidentical model implementations. Complex operations such as database\naccess are referred back to the high-level python module using\ncall-back mechanisms.\n",
            "description_content_type": "text/markdown",
            "docs_url": null,
            "download_url": "",
            "downloads": {
                "last_day": -1,
                "last_month": -1,
                "last_week": -1
            },
            "home_page": "",
            "keywords": "",
            "license": "",
            "maintainer": "",
            "maintainer_email": "",
            "name": "modena",
            "package_url": "https://pypi.org/project/modena/",
            "platform": null,
            "project_url": "https://pypi.org/project/modena/",
            "project_urls": null,
            "release_url": "https://pypi.org/project/modena/0.0.1/",
            "requires_dist": [
                "blessings",
                "decorator",
                "mongoengine",
                "numpy",
                "Pillow",
                "pymongo",
                "rpy2",
                "scipy",
                "scour",
                "singledispatch",
                "six",
                "sqlalchemy",
                "fireworks"
            ],
            "requires_python": "",
            "summary": "Simulation framework application facilitating     simulation of interconnected models",
            "version": "0.0.1",
            "yanked": false,
            "yanked_reason": null
        },
        "last_serial": 14517825,
        "urls": [
            {
                "comment_text": "",
                "digests": {
                    "md5": "ade1c4a59ac40a21e40bb9a5b7f624b9",
                    "sha256": "8b6841afc632f12d219f93f1e19cb12860ec0ce6ba0ee63012bdf3dbe5f30ec6"
                },
                "downloads": -1,
                "filename": "modena-0.0.1-py3-none-any.whl",
                "has_sig": false,
                "md5_digest": "ade1c4a59ac40a21e40bb9a5b7f624b9",
                "packagetype": "bdist_wheel",
                "python_version": "py3",
                "requires_python": null,
                "size": 209127,
                "upload_time": "2022-07-22T15:39:12",
                "upload_time_iso_8601": "2022-07-22T15:39:12.280822Z",
                "url": "https://files.pythonhosted.org/packages/5d/eb/f3219032d7eff0905c3d4b0b1ce33b7bed867d8c991782b8365227aaffae/modena-0.0.1-py3-none-any.whl",
                "yanked": false,
                "yanked_reason": null
            },
            {
                "comment_text": "",
                "digests": {
                    "md5": "2b89f7cccdbcba791954689d6d28af12",
                    "sha256": "5535a709d8f1357083cb780e2a5b0f19914395bdc2956a33e18d93d073e81b30"
                },
                "downloads": -1,
                "filename": "modena-0.0.1.tar.gz",
                "has_sig": false,
                "md5_digest": "2b89f7cccdbcba791954689d6d28af12",
                "packagetype": "sdist",
                "python_version": "source",
                "requires_python": null,
                "size": 198474,
                "upload_time": "2022-07-22T15:39:14",
                "upload_time_iso_8601": "2022-07-22T15:39:14.224877Z",
                "url": "https://files.pythonhosted.org/packages/eb/4b/820c95f8f16b6a5aa49e5f434e579125ed7b23b132cfa19b3c55d57d967e/modena-0.0.1.tar.gz",
                "yanked": false,
                "yanked_reason": null
            }
        ],
        "vulnerabilities": []
    }
}