{
    "1.0.0": {
        "info": {
            "author": "",
            "author_email": "Data Miner <info@sysnet.cz>",
            "bugtrack_url": null,
            "classifiers": [
                "License :: Free For Home Use",
                "Operating System :: OS Independent",
                "Programming Language :: Python :: 3",
                "Topic :: Database :: Front-Ends"
            ],
            "description_content_type": "text/markdown",
            "docs_url": null,
            "download_url": "",
            "downloads": {
                "last_day": -1,
                "last_month": -1,
                "last_week": -1
            },
            "home_page": "",
            "keywords": "",
            "license": "# LICENCE PRO DOMÁCÍ POUŽITÍ (SYSNET Home Use License) v 1.0  ## SHUL © SYSNET s.r.o. 2022  <h4 style=\"text-align: center;\">Tato komerční licence SYSNET s.r.o. se vztahuje na dílo (ve smyslu níže uvedených definic), které se poskytuje podle podmínek této licence. Použití díla v rozporu s touto licencí je zakázáno (v míře, v jaké se na uvedené použití vztahuje právo držitele autorských práv k dílu). Dílo se poskytuje podle podmínek této licence, pokud poskytovatel licence (ve smyslu níže uvedených definic) bezprostředně za doložku o autorských právech k dílu umístil toto upozornění: Na toto dílo se vztahuje licence SHUL nebo jakýmkoli jiným způsobem vyjádřil úmysl, aby se dílo poskytovalo podle licence SHUL. </h4>  ## 1. Definice  V rámci této licence mají následující výrazy tento význam:  * „Licencí“ se rozumí tato licence. * „Původním dílem“ se rozumí dílo nebo software šířené nebo sdělené poskytovatelem licence podle této licence, dostupné jako zdrojový kód anebo též jako spustitelný kód. * „Odvozenými díly“ se rozumí díla nebo software, které by nabyvatel licence mohl vytvořit na základě původního díla nebo jeho úprav. V této licenci není definováno, jaká musí být míra úprav nebo závislosti na původním díle, aby bylo považováno za odvozené dílo; tuto míru určuje autorské právo použitelné v zemi podle článku 15. * „Dílem“ se rozumí původní dílo nebo díla z něj odvozená. * „Zdrojovým kódem“ se rozumí podoba díla čitelná pro člověka, kterou mohou lidé nejpohodlněji analyzovat a upravovat. * „Spustitelným kódem“ se rozumí takový kód, který byl obecně sestaven a jenž má být interpretován počítačem jako program. * „Poskytovatelem licence“ se rozumí fyzická nebo právnická osoba, která dílo podle licence šíří nebo sděluje. * „Přispěvatelem“ se rozumí fyzická nebo právnická osoba, jež dílo podle licence upraví nebo jinak přispěje k vytvoření odvozeného díla. * „Nabyvatelem licence“ nebo „Vámi“ se rozumí fyzická nebo právnická osoba, která používá dílo podle podmínek licence. * „Šířením“ nebo „sdělováním“ se rozumí prodej, předání, zapůjčení, pronájem, šíření, sdělování, přenos nebo jiný způsob zpřístupnění kopií díla nebo zpřístupnění jeho podstatných funkcí jakékoli fyzické nebo právnické osobě, a to online nebo offline.  ## 2. Rozsah práv udělených licencí  Poskytovatel licence Vám tímto po dobu trvání autorských práv k původnímu dílu udílí celosvětovou, bezúplatnou, nevýhradní licenci bez možnosti poskytování podlicence, k těmto činnostem:  * používání díla pro soukromé domácí účely a pro nekomerční použití, * rozmnožování díla v rámci domácnosti, * úpravě díla a vytvoření odvozených děl na základě díla v rámci domácnosti a pro nekomerční použití,  Uvedená práva lze uplatnit na všechna média, nosiče a formáty, které jsou v současnosti známé nebo budou v budoucnu vynalezeny, do té míry, do jaké to připouští rozhodné právo. V zemích, kde se uplatňují osobnostní práva, se poskytovatel licence vzdává práva vykonávat své osobnostní právo v rozsahu, v jakém to rozhodné právo umožňuje, aby tak byl umožněn účinný výkon majetkových práv výše uvedených. Poskytovatel licence v míře nezbytné k využívání práv udělených k dílu podle této licence udílí nabyvateli licence bezúplatná, nevýlučná práva na využití případných patentů náležejících poskytovateli licence.  ## 3. Sdělování zdrojového kódu  Poskytovatel licence může poskytnout dílo buď v podobě zdrojového kódu, nebo jako spustitelný kód. Pokud se dílo poskytuje v podobě spustitelného kódu, poskytovatel licence navíc společně s každou kopií díla, kterou šíří nebo na ni odkazuje, poskytne strojově čitelné vyhotovení zdrojového kódu díla; může též v závěru doložky o autorských plánech odkázat na umístění, kde se po dobu, kdy poskytovatel licence šíří nebo sděluje dílo, nachází snadno a volně dostupný zdrojový kód.  ## 4. Omezení autorských práv  Žádným ustanovením této licence nemůže být nabyvatel licence zbaven výhod z případných výjimek z výlučných práv majitelů práv k dílu nebo případného omezení těchto výlučných práv, nebo z vyčerpání uvedených práv nebo z jiných relevantních omezení vztahujících se k takovým právům.  ## 5. Závazky nabyvatele licence  Udělení uvedených práv podléhá určitým omezením a závazkům vůči nabyvateli licence. Jedná se o tyto závazky:  * **Právo na označení**: Nabyvatel licence zachová beze změny veškerá oznámení týkající se autorských práv, patentů či ochranných známek a veškerá oznámení odkazující na licenci a na vyloučení záruk. Kopii takových oznámení a kopii licence musí nabyvatel licence připojit ke každé kopii díla, kterou šíří nebo sděluje. Nabyvatel licence musí zajistit, aby odvozené dílo bylo opatřeno výrazným oznámením, že původní dílo bylo upraveno, a též datem úpravy.  * **Ustanovení o nezměnitelnosti podmínek** (tzv. copyleft clause): Pokud nabyvatel licence šíří nebo sděluje kopie původních děl nebo odvozených děl, uvedené šíření nebo sdělování bude probíhat podle podmínek této licence nebo podle pozdější verze této licence, není-li původní dílo výslovně šířeno pouze pod touto verzí licence – např. označením „výlučně SHUL v. 1.0“. Nabyvatel licence (který se stává poskytovatelem licence) nemůže v souvislosti s dílem nebo odvozeným dílem nabízet nebo ukládat žádné dodatečné podmínky, které by měnily nebo omezovaly podmínky licence.  * **Poskytování zdrojového kódu**: Při šíření nebo sdělování kopií díla nabyvatel licence poskytne strojově čitelné znění zdrojového kódu nebo odkáže na umístění, kde po dobu, kdy nabyvatel licence pokračuje v šíření nebo sdělování díla, je uvedený zdrojový kód snadno a volně přístupný.  * **Právní ochrana**: Touto licencí se nepovoluje použít obchodní názvy, ochranné známky pro výrobky a služby nebo názvy poskytovatele licence, s výjimkou případů, kdy tento požadavek vzniká s ohledem na přiměřené a obvyklé použití při popisu původu díla a při reprodukci obsahu doložky o autorských právech.  ## 6. Řetězec autorství  Původní poskytovatel licence prohlašuje, že je majitelem autorských práv k původnímu dílu, jež jsou předmětem této licence, nebo že mu k nim byla udělena licence a že má pravomoc a oprávnění licenci udělit. Každý přispěvatel prohlašuje, že je majitelem autorských práv k úpravám, kterými dílo mění, nebo že mu k nim byla udělena licence a že má pravomoc a oprávnění licenci udělit. Kdykoli přijmete licenci, původní poskytovatel licence a následní přispěvatelé Vám udílejí licenci ke svým příspěvkům k dílu podle podmínek této licence.  ## 7. Vyloučení záruky  Dílo se chápe jako dílo, které se stále vyvíjí a které četní přispěvatelé průběžně zdokonalují. Nejedná se o hotové dílo, a může proto obsahovat vady či chyby v programu, které se při takovémto způsobu vývoje běžně vyskytují. Z uvedeného důvodu se dílo podle licence poskytuje v podobě tak, jak je, a bez jakýchkoli záruk k dílu, včetně, mimo jiné, obchodovatelnosti, vhodnosti pro konkrétní účel, bezchybnosti a nechybovosti, přesnosti, neporušení práv duševního vlastnictví vyjma práva autorského, jak je uvedeno v článku 6 této licence. Toto odmítnutí záruky je nedílnou součástí licence a podmínkou pro udělení jakýchkoli práv k dílu.  ## 8. Vyloučení odpovědnosti  S výjimkou případů úmyslného pochybení nebo škod přímo způsobených fyzickým osobám nenese poskytovatel licence v žádném případě odpovědnost za jakékoli přímé nebo nepřímé škody, hmotnou nebo mravní újmu či jakékoli jiné škody vyplývající z licence nebo použití díla, včetně škod způsobených ztrátou dobré pověsti, přerušením práce, poruchou nebo nesprávným fungováním počítače, ztrátou dat nebo jakýchkoli škod komerční povahy, a to i tehdy, pokud poskytovatel licence byl na možnost takové škody upozorněn. Poskytovatel licence však ponese odpovědnost podle zákonů týkajících se odpovědnosti za škodu způsobenou vadou výrobku v míře, v jaké se takové zákony na dané dílo vztahují.  ## 9. Dodatečné dohody  Při rozšiřování díla se můžete rozhodnout uzavřít dodatečné dohody, v nichž se vymezí povinnosti nebo služby v souladu s touto licencí. Pokud však na sebe vezmete závazky, můžete jednat pouze vlastním jménem a výhradně na vlastní odpovědnost, nikoli jménem původního poskytovatele licence či jakéhokoli dalšího přispěvatele, a pouze pokud souhlasíte s tím, že každého přispěvatele odškodníte, budete hájit a uchráníte před škodou nebo uplatňovanými nároky, pokud jde o jakoukoli odpovědnost vzniklou uvedenému přispěvateli v důsledku skutečnosti, že jste přijali záruku nebo dodatečnou odpovědnost.  ## 10. Přijetí licence  S ustanoveními této licence lze vyjádřit souhlas kliknutím na ikonu „Souhlasím“ („I agree“) umístěnou pod oknem, kde je zobrazeno znění této licence, nebo vyjádřením souhlasu obdobným způsobem podle rozhodného práva. Kliknutím na uvedenou ikonu vyjadřujete zřejmý a neodvolatelný souhlas s touto licencí a veškerými jejími podmínkami. Obdobně tuto licenci a veškeré její podmínky neodvolatelně přijímáte, pokud vykonáváte práva, která jsou Vám poskytnuta v souladu s článkem 2 této licence, např. pokud dílo užíváte, vytváříte odvozené dílo nebo dílo nebo jeho kopie šíříte nebo sdělujete.  ## 11. Informování veřejnosti  Pokud dílo šíříte nebo sdělujete prostřednictvím elektronické komunikace (např. nabízíte stažení díla ze vzdáleného umístění), musí příslušný distribuční kanál nebo média (např. internetové stránky) uvádět alespoň takové informace určené veřejnosti, které jsou požadovány rozhodným právem ohledně poskytovatele licence, licence samotné a způsobu jejího zpřístupnění, uzavření, uchovávání a reprodukování nabyvatelem licence.  ## 12. Zánik licence  Platnost licence a práv touto licencí udělených bez dalšího zaniká, pokud nabyvatel licence poruší jakýmkoli způsobem podmínky licence. Uvedeným zánikem není ukončena licence jakékoli osoby, která podle licence dílo obdržela od nabyvatele licence, za podmínky, že takové osoby nadále plně jednají v souladu s podmínkami licence.  ## 13. Různé  Aniž je dotčen výše uvedený článek 9, představuje licence úplnou dohodu mezi stranami, pokud jde o dílo. Je-li podle rozhodného práva jakékoli ustanovení této licence neplatné nebo nevymahatelné, neovlivní tato skutečnost platnost nebo vymahatelnost licence jako celku. Takové ustanovení se vyloží nebo podle potřeby upraví tak, aby bylo platné a vymahatelné. Evropská komise může v požadované a přiměřené míře zveřejnit další jazykové verze nebo nové verze této licence nebo aktualizované verze dodatku, aniž by omezila rozsah práv udělených licencí. Novým verzím bude při zveřejnění přiděleno jedinečné číslo verze. Všechny jazykové verze této licence schválené Evropskou komisí mají stejnou platnost. Strany mohou využít jazykové verze dle svého výběru.  ## 14. Soudní příslušnost  Aniž jsou dotčeny zvláštní dohody mezi stranami,  * soudní spor, který by popřípadě vyplynul z výkladu této licence mezi stranami, se bude řídit výlučnou pravomocí příslušného soudu, kde má poskytovatel licence bydliště nebo vykonává hlavní obchodní činnost.  ## 15. Rozhodné právo  Aniž jsou dotčeny zvláštní dohody mezi stranami,  * tato licence se řídí právem České republiky ",
            "maintainer": "",
            "maintainer_email": "",
            "name": "sysnet-shopping",
            "package_url": "https://pypi.org/project/sysnet-shopping/",
            "platform": null,
            "project_url": "https://pypi.org/project/sysnet-shopping/",
            "project_urls": {
                "Homepage": "https://github.com/SYSNET-CZ/mining/tree/main/shopping"
            },
            "release_url": "https://pypi.org/project/sysnet-shopping/1.0.0/",
            "requires_dist": null,
            "requires_python": ">=3.7",
            "summary": "Data mining shopping portals",
            "version": "1.0.0",
            "yanked": false,
            "yanked_reason": null
        },
        "last_serial": 16072380,
        "urls": [
            {
                "comment_text": "",
                "digests": {
                    "md5": "5e6d77aa0f52b86f202d8af591b42426",
                    "sha256": "7dd6070c790bfccec84aac6533097408764c2a78864fb733312b5424dbd8d2e3"
                },
                "downloads": -1,
                "filename": "sysnet_shopping-1.0.0-py3-none-any.whl",
                "has_sig": false,
                "md5_digest": "5e6d77aa0f52b86f202d8af591b42426",
                "packagetype": "bdist_wheel",
                "python_version": "py3",
                "requires_python": ">=3.7",
                "size": 23337,
                "upload_time": "2022-12-10T18:20:47",
                "upload_time_iso_8601": "2022-12-10T18:20:47.810522Z",
                "url": "https://files.pythonhosted.org/packages/7b/0d/291729b79dec34b9e40568883e3dfd157dd1ef072a3d51207fa5c939d9f9/sysnet_shopping-1.0.0-py3-none-any.whl",
                "yanked": false,
                "yanked_reason": null
            },
            {
                "comment_text": "",
                "digests": {
                    "md5": "36c2f96b22302d5848fa00bcbcbc9672",
                    "sha256": "b24d954cb4236cb0656bf8bb8fb8de86c8950b2aebc3c578ef992a39c5d98aab"
                },
                "downloads": -1,
                "filename": "sysnet-shopping-1.0.0.tar.gz",
                "has_sig": false,
                "md5_digest": "36c2f96b22302d5848fa00bcbcbc9672",
                "packagetype": "sdist",
                "python_version": "source",
                "requires_python": ">=3.7",
                "size": 23181,
                "upload_time": "2022-12-10T18:20:50",
                "upload_time_iso_8601": "2022-12-10T18:20:50.509242Z",
                "url": "https://files.pythonhosted.org/packages/f4/d6/41b64995a1914d5b4be124aa5ba8dedde575b0a4353ffe191775d819bd5d/sysnet-shopping-1.0.0.tar.gz",
                "yanked": false,
                "yanked_reason": null
            }
        ],
        "vulnerabilities": []
    },
    "1.0.1": {
        "info": {
            "author": "",
            "author_email": "Data Miner <info@sysnet.cz>",
            "bugtrack_url": null,
            "classifiers": [
                "License :: Free For Home Use",
                "Operating System :: OS Independent",
                "Programming Language :: Python :: 3",
                "Topic :: Database :: Front-Ends"
            ],
            "description_content_type": "text/markdown",
            "docs_url": null,
            "download_url": "",
            "downloads": {
                "last_day": -1,
                "last_month": -1,
                "last_week": -1
            },
            "home_page": "",
            "keywords": "",
            "license": "# LICENCE PRO DOMÁCÍ POUŽITÍ (SYSNET Home Use License) v 1.0  ## SHUL © SYSNET s.r.o. 2022  <h4 style=\"text-align: center;\">Tato komerční licence SYSNET s.r.o. se vztahuje na dílo (ve smyslu níže uvedených definic), které se poskytuje podle podmínek této licence. Použití díla v rozporu s touto licencí je zakázáno (v míře, v jaké se na uvedené použití vztahuje právo držitele autorských práv k dílu). Dílo se poskytuje podle podmínek této licence, pokud poskytovatel licence (ve smyslu níže uvedených definic) bezprostředně za doložku o autorských právech k dílu umístil toto upozornění: Na toto dílo se vztahuje licence SHUL nebo jakýmkoli jiným způsobem vyjádřil úmysl, aby se dílo poskytovalo podle licence SHUL. </h4>  ## 1. Definice  V rámci této licence mají následující výrazy tento význam:  * „Licencí“ se rozumí tato licence. * „Původním dílem“ se rozumí dílo nebo software šířené nebo sdělené poskytovatelem licence podle této licence, dostupné jako zdrojový kód anebo též jako spustitelný kód. * „Odvozenými díly“ se rozumí díla nebo software, které by nabyvatel licence mohl vytvořit na základě původního díla nebo jeho úprav. V této licenci není definováno, jaká musí být míra úprav nebo závislosti na původním díle, aby bylo považováno za odvozené dílo; tuto míru určuje autorské právo použitelné v zemi podle článku 15. * „Dílem“ se rozumí původní dílo nebo díla z něj odvozená. * „Zdrojovým kódem“ se rozumí podoba díla čitelná pro člověka, kterou mohou lidé nejpohodlněji analyzovat a upravovat. * „Spustitelným kódem“ se rozumí takový kód, který byl obecně sestaven a jenž má být interpretován počítačem jako program. * „Poskytovatelem licence“ se rozumí fyzická nebo právnická osoba, která dílo podle licence šíří nebo sděluje. * „Přispěvatelem“ se rozumí fyzická nebo právnická osoba, jež dílo podle licence upraví nebo jinak přispěje k vytvoření odvozeného díla. * „Nabyvatelem licence“ nebo „Vámi“ se rozumí fyzická nebo právnická osoba, která používá dílo podle podmínek licence. * „Šířením“ nebo „sdělováním“ se rozumí prodej, předání, zapůjčení, pronájem, šíření, sdělování, přenos nebo jiný způsob zpřístupnění kopií díla nebo zpřístupnění jeho podstatných funkcí jakékoli fyzické nebo právnické osobě, a to online nebo offline.  ## 2. Rozsah práv udělených licencí  Poskytovatel licence Vám tímto po dobu trvání autorských práv k původnímu dílu udílí celosvětovou, bezúplatnou, nevýhradní licenci bez možnosti poskytování podlicence, k těmto činnostem:  * používání díla pro soukromé domácí účely a pro nekomerční použití, * rozmnožování díla v rámci domácnosti, * úpravě díla a vytvoření odvozených děl na základě díla v rámci domácnosti a pro nekomerční použití,  Uvedená práva lze uplatnit na všechna média, nosiče a formáty, které jsou v současnosti známé nebo budou v budoucnu vynalezeny, do té míry, do jaké to připouští rozhodné právo. V zemích, kde se uplatňují osobnostní práva, se poskytovatel licence vzdává práva vykonávat své osobnostní právo v rozsahu, v jakém to rozhodné právo umožňuje, aby tak byl umožněn účinný výkon majetkových práv výše uvedených. Poskytovatel licence v míře nezbytné k využívání práv udělených k dílu podle této licence udílí nabyvateli licence bezúplatná, nevýlučná práva na využití případných patentů náležejících poskytovateli licence.  ## 3. Sdělování zdrojového kódu  Poskytovatel licence může poskytnout dílo buď v podobě zdrojového kódu, nebo jako spustitelný kód. Pokud se dílo poskytuje v podobě spustitelného kódu, poskytovatel licence navíc společně s každou kopií díla, kterou šíří nebo na ni odkazuje, poskytne strojově čitelné vyhotovení zdrojového kódu díla; může též v závěru doložky o autorských plánech odkázat na umístění, kde se po dobu, kdy poskytovatel licence šíří nebo sděluje dílo, nachází snadno a volně dostupný zdrojový kód.  ## 4. Omezení autorských práv  Žádným ustanovením této licence nemůže být nabyvatel licence zbaven výhod z případných výjimek z výlučných práv majitelů práv k dílu nebo případného omezení těchto výlučných práv, nebo z vyčerpání uvedených práv nebo z jiných relevantních omezení vztahujících se k takovým právům.  ## 5. Závazky nabyvatele licence  Udělení uvedených práv podléhá určitým omezením a závazkům vůči nabyvateli licence. Jedná se o tyto závazky:  * **Právo na označení**: Nabyvatel licence zachová beze změny veškerá oznámení týkající se autorských práv, patentů či ochranných známek a veškerá oznámení odkazující na licenci a na vyloučení záruk. Kopii takových oznámení a kopii licence musí nabyvatel licence připojit ke každé kopii díla, kterou šíří nebo sděluje. Nabyvatel licence musí zajistit, aby odvozené dílo bylo opatřeno výrazným oznámením, že původní dílo bylo upraveno, a též datem úpravy.  * **Ustanovení o nezměnitelnosti podmínek** (tzv. copyleft clause): Pokud nabyvatel licence šíří nebo sděluje kopie původních děl nebo odvozených děl, uvedené šíření nebo sdělování bude probíhat podle podmínek této licence nebo podle pozdější verze této licence, není-li původní dílo výslovně šířeno pouze pod touto verzí licence – např. označením „výlučně SHUL v. 1.0“. Nabyvatel licence (který se stává poskytovatelem licence) nemůže v souvislosti s dílem nebo odvozeným dílem nabízet nebo ukládat žádné dodatečné podmínky, které by měnily nebo omezovaly podmínky licence.  * **Poskytování zdrojového kódu**: Při šíření nebo sdělování kopií díla nabyvatel licence poskytne strojově čitelné znění zdrojového kódu nebo odkáže na umístění, kde po dobu, kdy nabyvatel licence pokračuje v šíření nebo sdělování díla, je uvedený zdrojový kód snadno a volně přístupný.  * **Právní ochrana**: Touto licencí se nepovoluje použít obchodní názvy, ochranné známky pro výrobky a služby nebo názvy poskytovatele licence, s výjimkou případů, kdy tento požadavek vzniká s ohledem na přiměřené a obvyklé použití při popisu původu díla a při reprodukci obsahu doložky o autorských právech.  ## 6. Řetězec autorství  Původní poskytovatel licence prohlašuje, že je majitelem autorských práv k původnímu dílu, jež jsou předmětem této licence, nebo že mu k nim byla udělena licence a že má pravomoc a oprávnění licenci udělit. Každý přispěvatel prohlašuje, že je majitelem autorských práv k úpravám, kterými dílo mění, nebo že mu k nim byla udělena licence a že má pravomoc a oprávnění licenci udělit. Kdykoli přijmete licenci, původní poskytovatel licence a následní přispěvatelé Vám udílejí licenci ke svým příspěvkům k dílu podle podmínek této licence.  ## 7. Vyloučení záruky  Dílo se chápe jako dílo, které se stále vyvíjí a které četní přispěvatelé průběžně zdokonalují. Nejedná se o hotové dílo, a může proto obsahovat vady či chyby v programu, které se při takovémto způsobu vývoje běžně vyskytují. Z uvedeného důvodu se dílo podle licence poskytuje v podobě tak, jak je, a bez jakýchkoli záruk k dílu, včetně, mimo jiné, obchodovatelnosti, vhodnosti pro konkrétní účel, bezchybnosti a nechybovosti, přesnosti, neporušení práv duševního vlastnictví vyjma práva autorského, jak je uvedeno v článku 6 této licence. Toto odmítnutí záruky je nedílnou součástí licence a podmínkou pro udělení jakýchkoli práv k dílu.  ## 8. Vyloučení odpovědnosti  S výjimkou případů úmyslného pochybení nebo škod přímo způsobených fyzickým osobám nenese poskytovatel licence v žádném případě odpovědnost za jakékoli přímé nebo nepřímé škody, hmotnou nebo mravní újmu či jakékoli jiné škody vyplývající z licence nebo použití díla, včetně škod způsobených ztrátou dobré pověsti, přerušením práce, poruchou nebo nesprávným fungováním počítače, ztrátou dat nebo jakýchkoli škod komerční povahy, a to i tehdy, pokud poskytovatel licence byl na možnost takové škody upozorněn. Poskytovatel licence však ponese odpovědnost podle zákonů týkajících se odpovědnosti za škodu způsobenou vadou výrobku v míře, v jaké se takové zákony na dané dílo vztahují.  ## 9. Dodatečné dohody  Při rozšiřování díla se můžete rozhodnout uzavřít dodatečné dohody, v nichž se vymezí povinnosti nebo služby v souladu s touto licencí. Pokud však na sebe vezmete závazky, můžete jednat pouze vlastním jménem a výhradně na vlastní odpovědnost, nikoli jménem původního poskytovatele licence či jakéhokoli dalšího přispěvatele, a pouze pokud souhlasíte s tím, že každého přispěvatele odškodníte, budete hájit a uchráníte před škodou nebo uplatňovanými nároky, pokud jde o jakoukoli odpovědnost vzniklou uvedenému přispěvateli v důsledku skutečnosti, že jste přijali záruku nebo dodatečnou odpovědnost.  ## 10. Přijetí licence  S ustanoveními této licence lze vyjádřit souhlas kliknutím na ikonu „Souhlasím“ („I agree“) umístěnou pod oknem, kde je zobrazeno znění této licence, nebo vyjádřením souhlasu obdobným způsobem podle rozhodného práva. Kliknutím na uvedenou ikonu vyjadřujete zřejmý a neodvolatelný souhlas s touto licencí a veškerými jejími podmínkami. Obdobně tuto licenci a veškeré její podmínky neodvolatelně přijímáte, pokud vykonáváte práva, která jsou Vám poskytnuta v souladu s článkem 2 této licence, např. pokud dílo užíváte, vytváříte odvozené dílo nebo dílo nebo jeho kopie šíříte nebo sdělujete.  ## 11. Informování veřejnosti  Pokud dílo šíříte nebo sdělujete prostřednictvím elektronické komunikace (např. nabízíte stažení díla ze vzdáleného umístění), musí příslušný distribuční kanál nebo média (např. internetové stránky) uvádět alespoň takové informace určené veřejnosti, které jsou požadovány rozhodným právem ohledně poskytovatele licence, licence samotné a způsobu jejího zpřístupnění, uzavření, uchovávání a reprodukování nabyvatelem licence.  ## 12. Zánik licence  Platnost licence a práv touto licencí udělených bez dalšího zaniká, pokud nabyvatel licence poruší jakýmkoli způsobem podmínky licence. Uvedeným zánikem není ukončena licence jakékoli osoby, která podle licence dílo obdržela od nabyvatele licence, za podmínky, že takové osoby nadále plně jednají v souladu s podmínkami licence.  ## 13. Různé  Aniž je dotčen výše uvedený článek 9, představuje licence úplnou dohodu mezi stranami, pokud jde o dílo. Je-li podle rozhodného práva jakékoli ustanovení této licence neplatné nebo nevymahatelné, neovlivní tato skutečnost platnost nebo vymahatelnost licence jako celku. Takové ustanovení se vyloží nebo podle potřeby upraví tak, aby bylo platné a vymahatelné. Evropská komise může v požadované a přiměřené míře zveřejnit další jazykové verze nebo nové verze této licence nebo aktualizované verze dodatku, aniž by omezila rozsah práv udělených licencí. Novým verzím bude při zveřejnění přiděleno jedinečné číslo verze. Všechny jazykové verze této licence schválené Evropskou komisí mají stejnou platnost. Strany mohou využít jazykové verze dle svého výběru.  ## 14. Soudní příslušnost  Aniž jsou dotčeny zvláštní dohody mezi stranami,  * soudní spor, který by popřípadě vyplynul z výkladu této licence mezi stranami, se bude řídit výlučnou pravomocí příslušného soudu, kde má poskytovatel licence bydliště nebo vykonává hlavní obchodní činnost.  ## 15. Rozhodné právo  Aniž jsou dotčeny zvláštní dohody mezi stranami,  * tato licence se řídí právem České republiky ",
            "maintainer": "",
            "maintainer_email": "",
            "name": "sysnet-shopping",
            "package_url": "https://pypi.org/project/sysnet-shopping/",
            "platform": null,
            "project_url": "https://pypi.org/project/sysnet-shopping/",
            "project_urls": {
                "Homepage": "https://github.com/SYSNET-CZ/mining/tree/main/shopping"
            },
            "release_url": "https://pypi.org/project/sysnet-shopping/1.0.1/",
            "requires_dist": null,
            "requires_python": ">=3.7",
            "summary": "Data mining shopping portals",
            "version": "1.0.1",
            "yanked": false,
            "yanked_reason": null
        },
        "last_serial": 16072380,
        "urls": [
            {
                "comment_text": "",
                "digests": {
                    "md5": "9ccaf118595921da13070e669179cfbd",
                    "sha256": "8f8fe54544f2cc93811caf9b00b7d518e81fb4c4a3f07f1caeb2eb557b0f0851"
                },
                "downloads": -1,
                "filename": "sysnet_shopping-1.0.1-py3-none-any.whl",
                "has_sig": false,
                "md5_digest": "9ccaf118595921da13070e669179cfbd",
                "packagetype": "bdist_wheel",
                "python_version": "py3",
                "requires_python": ">=3.7",
                "size": 23305,
                "upload_time": "2022-12-11T16:44:03",
                "upload_time_iso_8601": "2022-12-11T16:44:03.918976Z",
                "url": "https://files.pythonhosted.org/packages/17/47/ffbb59cc05aeb931d5d4859195c29cd6ad63f1c8c53e9935324f393b6074/sysnet_shopping-1.0.1-py3-none-any.whl",
                "yanked": false,
                "yanked_reason": null
            },
            {
                "comment_text": "",
                "digests": {
                    "md5": "95bae11761149e98e7df313587f4071a",
                    "sha256": "32b640cfd2c71180289fb5540371b8c82eed7509cc90f0df9d09cebb9c44c360"
                },
                "downloads": -1,
                "filename": "sysnet-shopping-1.0.1.tar.gz",
                "has_sig": false,
                "md5_digest": "95bae11761149e98e7df313587f4071a",
                "packagetype": "sdist",
                "python_version": "source",
                "requires_python": ">=3.7",
                "size": 23150,
                "upload_time": "2022-12-11T16:44:07",
                "upload_time_iso_8601": "2022-12-11T16:44:07.788348Z",
                "url": "https://files.pythonhosted.org/packages/80/55/738ba667be4e04fb61648c48de8a7ea0cd625ffc3f275c5440397f327d91/sysnet-shopping-1.0.1.tar.gz",
                "yanked": false,
                "yanked_reason": null
            }
        ],
        "vulnerabilities": []
    },
    "1.0.2": {
        "info": {
            "author": "",
            "author_email": "Data Miner <info@sysnet.cz>",
            "bugtrack_url": null,
            "classifiers": [
                "License :: Free For Home Use",
                "Operating System :: OS Independent",
                "Programming Language :: Python :: 3",
                "Topic :: Database :: Front-Ends"
            ],
            "description_content_type": "text/markdown",
            "docs_url": null,
            "download_url": "",
            "downloads": {
                "last_day": -1,
                "last_month": -1,
                "last_week": -1
            },
            "home_page": "",
            "keywords": "",
            "license": "# LICENCE PRO DOMÁCÍ POUŽITÍ (SYSNET Home Use License) v 1.0  ## SHUL © SYSNET s.r.o. 2022  <h4 style=\"text-align: center;\">Tato komerční licence SYSNET s.r.o. se vztahuje na dílo (ve smyslu níže uvedených definic), které se poskytuje podle podmínek této licence. Použití díla v rozporu s touto licencí je zakázáno (v míře, v jaké se na uvedené použití vztahuje právo držitele autorských práv k dílu). Dílo se poskytuje podle podmínek této licence, pokud poskytovatel licence (ve smyslu níže uvedených definic) bezprostředně za doložku o autorských právech k dílu umístil toto upozornění: Na toto dílo se vztahuje licence SHUL nebo jakýmkoli jiným způsobem vyjádřil úmysl, aby se dílo poskytovalo podle licence SHUL. </h4>  ## 1. Definice  V rámci této licence mají následující výrazy tento význam:  * „Licencí“ se rozumí tato licence. * „Původním dílem“ se rozumí dílo nebo software šířené nebo sdělené poskytovatelem licence podle této licence, dostupné jako zdrojový kód anebo též jako spustitelný kód. * „Odvozenými díly“ se rozumí díla nebo software, které by nabyvatel licence mohl vytvořit na základě původního díla nebo jeho úprav. V této licenci není definováno, jaká musí být míra úprav nebo závislosti na původním díle, aby bylo považováno za odvozené dílo; tuto míru určuje autorské právo použitelné v zemi podle článku 15. * „Dílem“ se rozumí původní dílo nebo díla z něj odvozená. * „Zdrojovým kódem“ se rozumí podoba díla čitelná pro člověka, kterou mohou lidé nejpohodlněji analyzovat a upravovat. * „Spustitelným kódem“ se rozumí takový kód, který byl obecně sestaven a jenž má být interpretován počítačem jako program. * „Poskytovatelem licence“ se rozumí fyzická nebo právnická osoba, která dílo podle licence šíří nebo sděluje. * „Přispěvatelem“ se rozumí fyzická nebo právnická osoba, jež dílo podle licence upraví nebo jinak přispěje k vytvoření odvozeného díla. * „Nabyvatelem licence“ nebo „Vámi“ se rozumí fyzická nebo právnická osoba, která používá dílo podle podmínek licence. * „Šířením“ nebo „sdělováním“ se rozumí prodej, předání, zapůjčení, pronájem, šíření, sdělování, přenos nebo jiný způsob zpřístupnění kopií díla nebo zpřístupnění jeho podstatných funkcí jakékoli fyzické nebo právnické osobě, a to online nebo offline.  ## 2. Rozsah práv udělených licencí  Poskytovatel licence Vám tímto po dobu trvání autorských práv k původnímu dílu udílí celosvětovou, bezúplatnou, nevýhradní licenci bez možnosti poskytování podlicence, k těmto činnostem:  * používání díla pro soukromé domácí účely a pro nekomerční použití, * rozmnožování díla v rámci domácnosti, * úpravě díla a vytvoření odvozených děl na základě díla v rámci domácnosti a pro nekomerční použití,  Uvedená práva lze uplatnit na všechna média, nosiče a formáty, které jsou v současnosti známé nebo budou v budoucnu vynalezeny, do té míry, do jaké to připouští rozhodné právo. V zemích, kde se uplatňují osobnostní práva, se poskytovatel licence vzdává práva vykonávat své osobnostní právo v rozsahu, v jakém to rozhodné právo umožňuje, aby tak byl umožněn účinný výkon majetkových práv výše uvedených. Poskytovatel licence v míře nezbytné k využívání práv udělených k dílu podle této licence udílí nabyvateli licence bezúplatná, nevýlučná práva na využití případných patentů náležejících poskytovateli licence.  ## 3. Sdělování zdrojového kódu  Poskytovatel licence může poskytnout dílo buď v podobě zdrojového kódu, nebo jako spustitelný kód. Pokud se dílo poskytuje v podobě spustitelného kódu, poskytovatel licence navíc společně s každou kopií díla, kterou šíří nebo na ni odkazuje, poskytne strojově čitelné vyhotovení zdrojového kódu díla; může též v závěru doložky o autorských plánech odkázat na umístění, kde se po dobu, kdy poskytovatel licence šíří nebo sděluje dílo, nachází snadno a volně dostupný zdrojový kód.  ## 4. Omezení autorských práv  Žádným ustanovením této licence nemůže být nabyvatel licence zbaven výhod z případných výjimek z výlučných práv majitelů práv k dílu nebo případného omezení těchto výlučných práv, nebo z vyčerpání uvedených práv nebo z jiných relevantních omezení vztahujících se k takovým právům.  ## 5. Závazky nabyvatele licence  Udělení uvedených práv podléhá určitým omezením a závazkům vůči nabyvateli licence. Jedná se o tyto závazky:  * **Právo na označení**: Nabyvatel licence zachová beze změny veškerá oznámení týkající se autorských práv, patentů či ochranných známek a veškerá oznámení odkazující na licenci a na vyloučení záruk. Kopii takových oznámení a kopii licence musí nabyvatel licence připojit ke každé kopii díla, kterou šíří nebo sděluje. Nabyvatel licence musí zajistit, aby odvozené dílo bylo opatřeno výrazným oznámením, že původní dílo bylo upraveno, a též datem úpravy.  * **Ustanovení o nezměnitelnosti podmínek** (tzv. copyleft clause): Pokud nabyvatel licence šíří nebo sděluje kopie původních děl nebo odvozených děl, uvedené šíření nebo sdělování bude probíhat podle podmínek této licence nebo podle pozdější verze této licence, není-li původní dílo výslovně šířeno pouze pod touto verzí licence – např. označením „výlučně SHUL v. 1.0“. Nabyvatel licence (který se stává poskytovatelem licence) nemůže v souvislosti s dílem nebo odvozeným dílem nabízet nebo ukládat žádné dodatečné podmínky, které by měnily nebo omezovaly podmínky licence.  * **Poskytování zdrojového kódu**: Při šíření nebo sdělování kopií díla nabyvatel licence poskytne strojově čitelné znění zdrojového kódu nebo odkáže na umístění, kde po dobu, kdy nabyvatel licence pokračuje v šíření nebo sdělování díla, je uvedený zdrojový kód snadno a volně přístupný.  * **Právní ochrana**: Touto licencí se nepovoluje použít obchodní názvy, ochranné známky pro výrobky a služby nebo názvy poskytovatele licence, s výjimkou případů, kdy tento požadavek vzniká s ohledem na přiměřené a obvyklé použití při popisu původu díla a při reprodukci obsahu doložky o autorských právech.  ## 6. Řetězec autorství  Původní poskytovatel licence prohlašuje, že je majitelem autorských práv k původnímu dílu, jež jsou předmětem této licence, nebo že mu k nim byla udělena licence a že má pravomoc a oprávnění licenci udělit. Každý přispěvatel prohlašuje, že je majitelem autorských práv k úpravám, kterými dílo mění, nebo že mu k nim byla udělena licence a že má pravomoc a oprávnění licenci udělit. Kdykoli přijmete licenci, původní poskytovatel licence a následní přispěvatelé Vám udílejí licenci ke svým příspěvkům k dílu podle podmínek této licence.  ## 7. Vyloučení záruky  Dílo se chápe jako dílo, které se stále vyvíjí a které četní přispěvatelé průběžně zdokonalují. Nejedná se o hotové dílo, a může proto obsahovat vady či chyby v programu, které se při takovémto způsobu vývoje běžně vyskytují. Z uvedeného důvodu se dílo podle licence poskytuje v podobě tak, jak je, a bez jakýchkoli záruk k dílu, včetně, mimo jiné, obchodovatelnosti, vhodnosti pro konkrétní účel, bezchybnosti a nechybovosti, přesnosti, neporušení práv duševního vlastnictví vyjma práva autorského, jak je uvedeno v článku 6 této licence. Toto odmítnutí záruky je nedílnou součástí licence a podmínkou pro udělení jakýchkoli práv k dílu.  ## 8. Vyloučení odpovědnosti  S výjimkou případů úmyslného pochybení nebo škod přímo způsobených fyzickým osobám nenese poskytovatel licence v žádném případě odpovědnost za jakékoli přímé nebo nepřímé škody, hmotnou nebo mravní újmu či jakékoli jiné škody vyplývající z licence nebo použití díla, včetně škod způsobených ztrátou dobré pověsti, přerušením práce, poruchou nebo nesprávným fungováním počítače, ztrátou dat nebo jakýchkoli škod komerční povahy, a to i tehdy, pokud poskytovatel licence byl na možnost takové škody upozorněn. Poskytovatel licence však ponese odpovědnost podle zákonů týkajících se odpovědnosti za škodu způsobenou vadou výrobku v míře, v jaké se takové zákony na dané dílo vztahují.  ## 9. Dodatečné dohody  Při rozšiřování díla se můžete rozhodnout uzavřít dodatečné dohody, v nichž se vymezí povinnosti nebo služby v souladu s touto licencí. Pokud však na sebe vezmete závazky, můžete jednat pouze vlastním jménem a výhradně na vlastní odpovědnost, nikoli jménem původního poskytovatele licence či jakéhokoli dalšího přispěvatele, a pouze pokud souhlasíte s tím, že každého přispěvatele odškodníte, budete hájit a uchráníte před škodou nebo uplatňovanými nároky, pokud jde o jakoukoli odpovědnost vzniklou uvedenému přispěvateli v důsledku skutečnosti, že jste přijali záruku nebo dodatečnou odpovědnost.  ## 10. Přijetí licence  S ustanoveními této licence lze vyjádřit souhlas kliknutím na ikonu „Souhlasím“ („I agree“) umístěnou pod oknem, kde je zobrazeno znění této licence, nebo vyjádřením souhlasu obdobným způsobem podle rozhodného práva. Kliknutím na uvedenou ikonu vyjadřujete zřejmý a neodvolatelný souhlas s touto licencí a veškerými jejími podmínkami. Obdobně tuto licenci a veškeré její podmínky neodvolatelně přijímáte, pokud vykonáváte práva, která jsou Vám poskytnuta v souladu s článkem 2 této licence, např. pokud dílo užíváte, vytváříte odvozené dílo nebo dílo nebo jeho kopie šíříte nebo sdělujete.  ## 11. Informování veřejnosti  Pokud dílo šíříte nebo sdělujete prostřednictvím elektronické komunikace (např. nabízíte stažení díla ze vzdáleného umístění), musí příslušný distribuční kanál nebo média (např. internetové stránky) uvádět alespoň takové informace určené veřejnosti, které jsou požadovány rozhodným právem ohledně poskytovatele licence, licence samotné a způsobu jejího zpřístupnění, uzavření, uchovávání a reprodukování nabyvatelem licence.  ## 12. Zánik licence  Platnost licence a práv touto licencí udělených bez dalšího zaniká, pokud nabyvatel licence poruší jakýmkoli způsobem podmínky licence. Uvedeným zánikem není ukončena licence jakékoli osoby, která podle licence dílo obdržela od nabyvatele licence, za podmínky, že takové osoby nadále plně jednají v souladu s podmínkami licence.  ## 13. Různé  Aniž je dotčen výše uvedený článek 9, představuje licence úplnou dohodu mezi stranami, pokud jde o dílo. Je-li podle rozhodného práva jakékoli ustanovení této licence neplatné nebo nevymahatelné, neovlivní tato skutečnost platnost nebo vymahatelnost licence jako celku. Takové ustanovení se vyloží nebo podle potřeby upraví tak, aby bylo platné a vymahatelné. Evropská komise může v požadované a přiměřené míře zveřejnit další jazykové verze nebo nové verze této licence nebo aktualizované verze dodatku, aniž by omezila rozsah práv udělených licencí. Novým verzím bude při zveřejnění přiděleno jedinečné číslo verze. Všechny jazykové verze této licence schválené Evropskou komisí mají stejnou platnost. Strany mohou využít jazykové verze dle svého výběru.  ## 14. Soudní příslušnost  Aniž jsou dotčeny zvláštní dohody mezi stranami,  * soudní spor, který by popřípadě vyplynul z výkladu této licence mezi stranami, se bude řídit výlučnou pravomocí příslušného soudu, kde má poskytovatel licence bydliště nebo vykonává hlavní obchodní činnost.  ## 15. Rozhodné právo  Aniž jsou dotčeny zvláštní dohody mezi stranami,  * tato licence se řídí právem České republiky ",
            "maintainer": "",
            "maintainer_email": "",
            "name": "sysnet-shopping",
            "package_url": "https://pypi.org/project/sysnet-shopping/",
            "platform": null,
            "project_url": "https://pypi.org/project/sysnet-shopping/",
            "project_urls": {
                "Homepage": "https://github.com/SYSNET-CZ/mining/tree/main/shopping"
            },
            "release_url": "https://pypi.org/project/sysnet-shopping/1.0.2/",
            "requires_dist": null,
            "requires_python": ">=3.7",
            "summary": "Data mining shopping portals",
            "version": "1.0.2",
            "yanked": false,
            "yanked_reason": null
        },
        "last_serial": 16072380,
        "urls": [
            {
                "comment_text": "",
                "digests": {
                    "md5": "60a681f1a5d6a1b47052e66a678e3884",
                    "sha256": "a30c765ec08501d865fb6cc13fe5dce9fd02371439e6176608732cba54883bfe"
                },
                "downloads": -1,
                "filename": "sysnet_shopping-1.0.2-py3-none-any.whl",
                "has_sig": false,
                "md5_digest": "60a681f1a5d6a1b47052e66a678e3884",
                "packagetype": "bdist_wheel",
                "python_version": "py3",
                "requires_python": ">=3.7",
                "size": 23661,
                "upload_time": "2022-12-11T18:32:11",
                "upload_time_iso_8601": "2022-12-11T18:32:11.134685Z",
                "url": "https://files.pythonhosted.org/packages/25/0e/cfabac806f9fc0176d6ec885f84d74b30aebfeb8c03f7180bbab3db39e63/sysnet_shopping-1.0.2-py3-none-any.whl",
                "yanked": false,
                "yanked_reason": null
            },
            {
                "comment_text": "",
                "digests": {
                    "md5": "facefc8172529280145fdd0a299079e0",
                    "sha256": "b9a82b197611e34df0d238e12dcc7204ffc7da769759f206562429d35dff8fdb"
                },
                "downloads": -1,
                "filename": "sysnet-shopping-1.0.2.tar.gz",
                "has_sig": false,
                "md5_digest": "facefc8172529280145fdd0a299079e0",
                "packagetype": "sdist",
                "python_version": "source",
                "requires_python": ">=3.7",
                "size": 23490,
                "upload_time": "2022-12-11T18:32:17",
                "upload_time_iso_8601": "2022-12-11T18:32:17.185572Z",
                "url": "https://files.pythonhosted.org/packages/c4/fc/6a3fe6fee1d5febbb28902dc4e3793b440ef47691785f5114e716e24e838/sysnet-shopping-1.0.2.tar.gz",
                "yanked": false,
                "yanked_reason": null
            }
        ],
        "vulnerabilities": []
    },
    "1.0.3": {
        "info": {
            "author": "",
            "author_email": "Data Miner <info@sysnet.cz>",
            "bugtrack_url": null,
            "classifiers": [
                "License :: Free For Home Use",
                "Operating System :: OS Independent",
                "Programming Language :: Python :: 3",
                "Topic :: Database :: Front-Ends"
            ],
            "description_content_type": "text/markdown",
            "docs_url": null,
            "download_url": "",
            "downloads": {
                "last_day": -1,
                "last_month": -1,
                "last_week": -1
            },
            "home_page": "",
            "keywords": "",
            "license": "# LICENCE PRO DOMÁCÍ POUŽITÍ (SYSNET Home Use License) v 1.0  ## SHUL © SYSNET s.r.o. 2022  <h4 style=\"text-align: center;\">Tato komerční licence SYSNET s.r.o. se vztahuje na dílo (ve smyslu níže uvedených definic), které se poskytuje podle podmínek této licence. Použití díla v rozporu s touto licencí je zakázáno (v míře, v jaké se na uvedené použití vztahuje právo držitele autorských práv k dílu). Dílo se poskytuje podle podmínek této licence, pokud poskytovatel licence (ve smyslu níže uvedených definic) bezprostředně za doložku o autorských právech k dílu umístil toto upozornění: Na toto dílo se vztahuje licence SHUL nebo jakýmkoli jiným způsobem vyjádřil úmysl, aby se dílo poskytovalo podle licence SHUL. </h4>  ## 1. Definice  V rámci této licence mají následující výrazy tento význam:  * „Licencí“ se rozumí tato licence. * „Původním dílem“ se rozumí dílo nebo software šířené nebo sdělené poskytovatelem licence podle této licence, dostupné jako zdrojový kód anebo též jako spustitelný kód. * „Odvozenými díly“ se rozumí díla nebo software, které by nabyvatel licence mohl vytvořit na základě původního díla nebo jeho úprav. V této licenci není definováno, jaká musí být míra úprav nebo závislosti na původním díle, aby bylo považováno za odvozené dílo; tuto míru určuje autorské právo použitelné v zemi podle článku 15. * „Dílem“ se rozumí původní dílo nebo díla z něj odvozená. * „Zdrojovým kódem“ se rozumí podoba díla čitelná pro člověka, kterou mohou lidé nejpohodlněji analyzovat a upravovat. * „Spustitelným kódem“ se rozumí takový kód, který byl obecně sestaven a jenž má být interpretován počítačem jako program. * „Poskytovatelem licence“ se rozumí fyzická nebo právnická osoba, která dílo podle licence šíří nebo sděluje. * „Přispěvatelem“ se rozumí fyzická nebo právnická osoba, jež dílo podle licence upraví nebo jinak přispěje k vytvoření odvozeného díla. * „Nabyvatelem licence“ nebo „Vámi“ se rozumí fyzická nebo právnická osoba, která používá dílo podle podmínek licence. * „Šířením“ nebo „sdělováním“ se rozumí prodej, předání, zapůjčení, pronájem, šíření, sdělování, přenos nebo jiný způsob zpřístupnění kopií díla nebo zpřístupnění jeho podstatných funkcí jakékoli fyzické nebo právnické osobě, a to online nebo offline.  ## 2. Rozsah práv udělených licencí  Poskytovatel licence Vám tímto po dobu trvání autorských práv k původnímu dílu udílí celosvětovou, bezúplatnou, nevýhradní licenci bez možnosti poskytování podlicence, k těmto činnostem:  * používání díla pro soukromé domácí účely a pro nekomerční použití, * rozmnožování díla v rámci domácnosti, * úpravě díla a vytvoření odvozených děl na základě díla v rámci domácnosti a pro nekomerční použití,  Uvedená práva lze uplatnit na všechna média, nosiče a formáty, které jsou v současnosti známé nebo budou v budoucnu vynalezeny, do té míry, do jaké to připouští rozhodné právo. V zemích, kde se uplatňují osobnostní práva, se poskytovatel licence vzdává práva vykonávat své osobnostní právo v rozsahu, v jakém to rozhodné právo umožňuje, aby tak byl umožněn účinný výkon majetkových práv výše uvedených. Poskytovatel licence v míře nezbytné k využívání práv udělených k dílu podle této licence udílí nabyvateli licence bezúplatná, nevýlučná práva na využití případných patentů náležejících poskytovateli licence.  ## 3. Sdělování zdrojového kódu  Poskytovatel licence může poskytnout dílo buď v podobě zdrojového kódu, nebo jako spustitelný kód. Pokud se dílo poskytuje v podobě spustitelného kódu, poskytovatel licence navíc společně s každou kopií díla, kterou šíří nebo na ni odkazuje, poskytne strojově čitelné vyhotovení zdrojového kódu díla; může též v závěru doložky o autorských plánech odkázat na umístění, kde se po dobu, kdy poskytovatel licence šíří nebo sděluje dílo, nachází snadno a volně dostupný zdrojový kód.  ## 4. Omezení autorských práv  Žádným ustanovením této licence nemůže být nabyvatel licence zbaven výhod z případných výjimek z výlučných práv majitelů práv k dílu nebo případného omezení těchto výlučných práv, nebo z vyčerpání uvedených práv nebo z jiných relevantních omezení vztahujících se k takovým právům.  ## 5. Závazky nabyvatele licence  Udělení uvedených práv podléhá určitým omezením a závazkům vůči nabyvateli licence. Jedná se o tyto závazky:  * **Právo na označení**: Nabyvatel licence zachová beze změny veškerá oznámení týkající se autorských práv, patentů či ochranných známek a veškerá oznámení odkazující na licenci a na vyloučení záruk. Kopii takových oznámení a kopii licence musí nabyvatel licence připojit ke každé kopii díla, kterou šíří nebo sděluje. Nabyvatel licence musí zajistit, aby odvozené dílo bylo opatřeno výrazným oznámením, že původní dílo bylo upraveno, a též datem úpravy.  * **Ustanovení o nezměnitelnosti podmínek** (tzv. copyleft clause): Pokud nabyvatel licence šíří nebo sděluje kopie původních děl nebo odvozených děl, uvedené šíření nebo sdělování bude probíhat podle podmínek této licence nebo podle pozdější verze této licence, není-li původní dílo výslovně šířeno pouze pod touto verzí licence – např. označením „výlučně SHUL v. 1.0“. Nabyvatel licence (který se stává poskytovatelem licence) nemůže v souvislosti s dílem nebo odvozeným dílem nabízet nebo ukládat žádné dodatečné podmínky, které by měnily nebo omezovaly podmínky licence.  * **Poskytování zdrojového kódu**: Při šíření nebo sdělování kopií díla nabyvatel licence poskytne strojově čitelné znění zdrojového kódu nebo odkáže na umístění, kde po dobu, kdy nabyvatel licence pokračuje v šíření nebo sdělování díla, je uvedený zdrojový kód snadno a volně přístupný.  * **Právní ochrana**: Touto licencí se nepovoluje použít obchodní názvy, ochranné známky pro výrobky a služby nebo názvy poskytovatele licence, s výjimkou případů, kdy tento požadavek vzniká s ohledem na přiměřené a obvyklé použití při popisu původu díla a při reprodukci obsahu doložky o autorských právech.  ## 6. Řetězec autorství  Původní poskytovatel licence prohlašuje, že je majitelem autorských práv k původnímu dílu, jež jsou předmětem této licence, nebo že mu k nim byla udělena licence a že má pravomoc a oprávnění licenci udělit. Každý přispěvatel prohlašuje, že je majitelem autorských práv k úpravám, kterými dílo mění, nebo že mu k nim byla udělena licence a že má pravomoc a oprávnění licenci udělit. Kdykoli přijmete licenci, původní poskytovatel licence a následní přispěvatelé Vám udílejí licenci ke svým příspěvkům k dílu podle podmínek této licence.  ## 7. Vyloučení záruky  Dílo se chápe jako dílo, které se stále vyvíjí a které četní přispěvatelé průběžně zdokonalují. Nejedná se o hotové dílo, a může proto obsahovat vady či chyby v programu, které se při takovémto způsobu vývoje běžně vyskytují. Z uvedeného důvodu se dílo podle licence poskytuje v podobě tak, jak je, a bez jakýchkoli záruk k dílu, včetně, mimo jiné, obchodovatelnosti, vhodnosti pro konkrétní účel, bezchybnosti a nechybovosti, přesnosti, neporušení práv duševního vlastnictví vyjma práva autorského, jak je uvedeno v článku 6 této licence. Toto odmítnutí záruky je nedílnou součástí licence a podmínkou pro udělení jakýchkoli práv k dílu.  ## 8. Vyloučení odpovědnosti  S výjimkou případů úmyslného pochybení nebo škod přímo způsobených fyzickým osobám nenese poskytovatel licence v žádném případě odpovědnost za jakékoli přímé nebo nepřímé škody, hmotnou nebo mravní újmu či jakékoli jiné škody vyplývající z licence nebo použití díla, včetně škod způsobených ztrátou dobré pověsti, přerušením práce, poruchou nebo nesprávným fungováním počítače, ztrátou dat nebo jakýchkoli škod komerční povahy, a to i tehdy, pokud poskytovatel licence byl na možnost takové škody upozorněn. Poskytovatel licence však ponese odpovědnost podle zákonů týkajících se odpovědnosti za škodu způsobenou vadou výrobku v míře, v jaké se takové zákony na dané dílo vztahují.  ## 9. Dodatečné dohody  Při rozšiřování díla se můžete rozhodnout uzavřít dodatečné dohody, v nichž se vymezí povinnosti nebo služby v souladu s touto licencí. Pokud však na sebe vezmete závazky, můžete jednat pouze vlastním jménem a výhradně na vlastní odpovědnost, nikoli jménem původního poskytovatele licence či jakéhokoli dalšího přispěvatele, a pouze pokud souhlasíte s tím, že každého přispěvatele odškodníte, budete hájit a uchráníte před škodou nebo uplatňovanými nároky, pokud jde o jakoukoli odpovědnost vzniklou uvedenému přispěvateli v důsledku skutečnosti, že jste přijali záruku nebo dodatečnou odpovědnost.  ## 10. Přijetí licence  S ustanoveními této licence lze vyjádřit souhlas kliknutím na ikonu „Souhlasím“ („I agree“) umístěnou pod oknem, kde je zobrazeno znění této licence, nebo vyjádřením souhlasu obdobným způsobem podle rozhodného práva. Kliknutím na uvedenou ikonu vyjadřujete zřejmý a neodvolatelný souhlas s touto licencí a veškerými jejími podmínkami. Obdobně tuto licenci a veškeré její podmínky neodvolatelně přijímáte, pokud vykonáváte práva, která jsou Vám poskytnuta v souladu s článkem 2 této licence, např. pokud dílo užíváte, vytváříte odvozené dílo nebo dílo nebo jeho kopie šíříte nebo sdělujete.  ## 11. Informování veřejnosti  Pokud dílo šíříte nebo sdělujete prostřednictvím elektronické komunikace (např. nabízíte stažení díla ze vzdáleného umístění), musí příslušný distribuční kanál nebo média (např. internetové stránky) uvádět alespoň takové informace určené veřejnosti, které jsou požadovány rozhodným právem ohledně poskytovatele licence, licence samotné a způsobu jejího zpřístupnění, uzavření, uchovávání a reprodukování nabyvatelem licence.  ## 12. Zánik licence  Platnost licence a práv touto licencí udělených bez dalšího zaniká, pokud nabyvatel licence poruší jakýmkoli způsobem podmínky licence. Uvedeným zánikem není ukončena licence jakékoli osoby, která podle licence dílo obdržela od nabyvatele licence, za podmínky, že takové osoby nadále plně jednají v souladu s podmínkami licence.  ## 13. Různé  Aniž je dotčen výše uvedený článek 9, představuje licence úplnou dohodu mezi stranami, pokud jde o dílo. Je-li podle rozhodného práva jakékoli ustanovení této licence neplatné nebo nevymahatelné, neovlivní tato skutečnost platnost nebo vymahatelnost licence jako celku. Takové ustanovení se vyloží nebo podle potřeby upraví tak, aby bylo platné a vymahatelné. Evropská komise může v požadované a přiměřené míře zveřejnit další jazykové verze nebo nové verze této licence nebo aktualizované verze dodatku, aniž by omezila rozsah práv udělených licencí. Novým verzím bude při zveřejnění přiděleno jedinečné číslo verze. Všechny jazykové verze této licence schválené Evropskou komisí mají stejnou platnost. Strany mohou využít jazykové verze dle svého výběru.  ## 14. Soudní příslušnost  Aniž jsou dotčeny zvláštní dohody mezi stranami,  * soudní spor, který by popřípadě vyplynul z výkladu této licence mezi stranami, se bude řídit výlučnou pravomocí příslušného soudu, kde má poskytovatel licence bydliště nebo vykonává hlavní obchodní činnost.  ## 15. Rozhodné právo  Aniž jsou dotčeny zvláštní dohody mezi stranami,  * tato licence se řídí právem České republiky ",
            "maintainer": "",
            "maintainer_email": "",
            "name": "sysnet-shopping",
            "package_url": "https://pypi.org/project/sysnet-shopping/",
            "platform": null,
            "project_url": "https://pypi.org/project/sysnet-shopping/",
            "project_urls": {
                "Homepage": "https://github.com/SYSNET-CZ/mining/tree/main/shopping"
            },
            "release_url": "https://pypi.org/project/sysnet-shopping/1.0.3/",
            "requires_dist": null,
            "requires_python": ">=3.7",
            "summary": "Data mining shopping portals",
            "version": "1.0.3",
            "yanked": false,
            "yanked_reason": null
        },
        "last_serial": 16072380,
        "urls": [
            {
                "comment_text": "",
                "digests": {
                    "md5": "c286dfdbf0fd35945cdb80ba46b21fe2",
                    "sha256": "c88431ef10132bf3368e68f054dacb9d63c35fb2b1159da4e854a680504d5275"
                },
                "downloads": -1,
                "filename": "sysnet_shopping-1.0.3-py3-none-any.whl",
                "has_sig": false,
                "md5_digest": "c286dfdbf0fd35945cdb80ba46b21fe2",
                "packagetype": "bdist_wheel",
                "python_version": "py3",
                "requires_python": ">=3.7",
                "size": 23663,
                "upload_time": "2022-12-11T18:37:35",
                "upload_time_iso_8601": "2022-12-11T18:37:35.270858Z",
                "url": "https://files.pythonhosted.org/packages/36/56/9d6241d687871a860ba6e6ee89140b2d3c0189a922f868e57406f71f43e0/sysnet_shopping-1.0.3-py3-none-any.whl",
                "yanked": false,
                "yanked_reason": null
            },
            {
                "comment_text": "",
                "digests": {
                    "md5": "35adb67ff53395f6366e9b55bdab9d13",
                    "sha256": "6a45081bf7619ef921ac26ec266c9c498e762dba77dec04c2a1e2632507224c3"
                },
                "downloads": -1,
                "filename": "sysnet-shopping-1.0.3.tar.gz",
                "has_sig": false,
                "md5_digest": "35adb67ff53395f6366e9b55bdab9d13",
                "packagetype": "sdist",
                "python_version": "source",
                "requires_python": ">=3.7",
                "size": 23502,
                "upload_time": "2022-12-11T18:37:38",
                "upload_time_iso_8601": "2022-12-11T18:37:38.574139Z",
                "url": "https://files.pythonhosted.org/packages/78/c8/fe957ee7a5672bb2b17232c895df6c5f0d69ed813863891cab659da44fe9/sysnet-shopping-1.0.3.tar.gz",
                "yanked": false,
                "yanked_reason": null
            }
        ],
        "vulnerabilities": []
    },
    "1.0.4": {
        "info": {
            "author": "",
            "author_email": "Data Miner <info@sysnet.cz>",
            "bugtrack_url": null,
            "classifiers": [
                "License :: Free For Home Use",
                "Operating System :: OS Independent",
                "Programming Language :: Python :: 3",
                "Topic :: Database :: Front-Ends"
            ],
            "description_content_type": "text/markdown",
            "docs_url": null,
            "download_url": "",
            "downloads": {
                "last_day": -1,
                "last_month": -1,
                "last_week": -1
            },
            "home_page": "",
            "keywords": "",
            "license": "# LICENCE PRO DOMÁCÍ POUŽITÍ (SYSNET Home Use License) v 1.0  ## SHUL © SYSNET s.r.o. 2022  <h4 style=\"text-align: center;\">Tato komerční licence SYSNET s.r.o. se vztahuje na dílo (ve smyslu níže uvedených definic), které se poskytuje podle podmínek této licence. Použití díla v rozporu s touto licencí je zakázáno (v míře, v jaké se na uvedené použití vztahuje právo držitele autorských práv k dílu). Dílo se poskytuje podle podmínek této licence, pokud poskytovatel licence (ve smyslu níže uvedených definic) bezprostředně za doložku o autorských právech k dílu umístil toto upozornění: Na toto dílo se vztahuje licence SHUL nebo jakýmkoli jiným způsobem vyjádřil úmysl, aby se dílo poskytovalo podle licence SHUL. </h4>  ## 1. Definice  V rámci této licence mají následující výrazy tento význam:  * „Licencí“ se rozumí tato licence. * „Původním dílem“ se rozumí dílo nebo software šířené nebo sdělené poskytovatelem licence podle této licence, dostupné jako zdrojový kód anebo též jako spustitelný kód. * „Odvozenými díly“ se rozumí díla nebo software, které by nabyvatel licence mohl vytvořit na základě původního díla nebo jeho úprav. V této licenci není definováno, jaká musí být míra úprav nebo závislosti na původním díle, aby bylo považováno za odvozené dílo; tuto míru určuje autorské právo použitelné v zemi podle článku 15. * „Dílem“ se rozumí původní dílo nebo díla z něj odvozená. * „Zdrojovým kódem“ se rozumí podoba díla čitelná pro člověka, kterou mohou lidé nejpohodlněji analyzovat a upravovat. * „Spustitelným kódem“ se rozumí takový kód, který byl obecně sestaven a jenž má být interpretován počítačem jako program. * „Poskytovatelem licence“ se rozumí fyzická nebo právnická osoba, která dílo podle licence šíří nebo sděluje. * „Přispěvatelem“ se rozumí fyzická nebo právnická osoba, jež dílo podle licence upraví nebo jinak přispěje k vytvoření odvozeného díla. * „Nabyvatelem licence“ nebo „Vámi“ se rozumí fyzická nebo právnická osoba, která používá dílo podle podmínek licence. * „Šířením“ nebo „sdělováním“ se rozumí prodej, předání, zapůjčení, pronájem, šíření, sdělování, přenos nebo jiný způsob zpřístupnění kopií díla nebo zpřístupnění jeho podstatných funkcí jakékoli fyzické nebo právnické osobě, a to online nebo offline.  ## 2. Rozsah práv udělených licencí  Poskytovatel licence Vám tímto po dobu trvání autorských práv k původnímu dílu udílí celosvětovou, bezúplatnou, nevýhradní licenci bez možnosti poskytování podlicence, k těmto činnostem:  * používání díla pro soukromé domácí účely a pro nekomerční použití, * rozmnožování díla v rámci domácnosti, * úpravě díla a vytvoření odvozených děl na základě díla v rámci domácnosti a pro nekomerční použití,  Uvedená práva lze uplatnit na všechna média, nosiče a formáty, které jsou v současnosti známé nebo budou v budoucnu vynalezeny, do té míry, do jaké to připouští rozhodné právo. V zemích, kde se uplatňují osobnostní práva, se poskytovatel licence vzdává práva vykonávat své osobnostní právo v rozsahu, v jakém to rozhodné právo umožňuje, aby tak byl umožněn účinný výkon majetkových práv výše uvedených. Poskytovatel licence v míře nezbytné k využívání práv udělených k dílu podle této licence udílí nabyvateli licence bezúplatná, nevýlučná práva na využití případných patentů náležejících poskytovateli licence.  ## 3. Sdělování zdrojového kódu  Poskytovatel licence může poskytnout dílo buď v podobě zdrojového kódu, nebo jako spustitelný kód. Pokud se dílo poskytuje v podobě spustitelného kódu, poskytovatel licence navíc společně s každou kopií díla, kterou šíří nebo na ni odkazuje, poskytne strojově čitelné vyhotovení zdrojového kódu díla; může též v závěru doložky o autorských plánech odkázat na umístění, kde se po dobu, kdy poskytovatel licence šíří nebo sděluje dílo, nachází snadno a volně dostupný zdrojový kód.  ## 4. Omezení autorských práv  Žádným ustanovením této licence nemůže být nabyvatel licence zbaven výhod z případných výjimek z výlučných práv majitelů práv k dílu nebo případného omezení těchto výlučných práv, nebo z vyčerpání uvedených práv nebo z jiných relevantních omezení vztahujících se k takovým právům.  ## 5. Závazky nabyvatele licence  Udělení uvedených práv podléhá určitým omezením a závazkům vůči nabyvateli licence. Jedná se o tyto závazky:  * **Právo na označení**: Nabyvatel licence zachová beze změny veškerá oznámení týkající se autorských práv, patentů či ochranných známek a veškerá oznámení odkazující na licenci a na vyloučení záruk. Kopii takových oznámení a kopii licence musí nabyvatel licence připojit ke každé kopii díla, kterou šíří nebo sděluje. Nabyvatel licence musí zajistit, aby odvozené dílo bylo opatřeno výrazným oznámením, že původní dílo bylo upraveno, a též datem úpravy.  * **Ustanovení o nezměnitelnosti podmínek** (tzv. copyleft clause): Pokud nabyvatel licence šíří nebo sděluje kopie původních děl nebo odvozených děl, uvedené šíření nebo sdělování bude probíhat podle podmínek této licence nebo podle pozdější verze této licence, není-li původní dílo výslovně šířeno pouze pod touto verzí licence – např. označením „výlučně SHUL v. 1.0“. Nabyvatel licence (který se stává poskytovatelem licence) nemůže v souvislosti s dílem nebo odvozeným dílem nabízet nebo ukládat žádné dodatečné podmínky, které by měnily nebo omezovaly podmínky licence.  * **Poskytování zdrojového kódu**: Při šíření nebo sdělování kopií díla nabyvatel licence poskytne strojově čitelné znění zdrojového kódu nebo odkáže na umístění, kde po dobu, kdy nabyvatel licence pokračuje v šíření nebo sdělování díla, je uvedený zdrojový kód snadno a volně přístupný.  * **Právní ochrana**: Touto licencí se nepovoluje použít obchodní názvy, ochranné známky pro výrobky a služby nebo názvy poskytovatele licence, s výjimkou případů, kdy tento požadavek vzniká s ohledem na přiměřené a obvyklé použití při popisu původu díla a při reprodukci obsahu doložky o autorských právech.  ## 6. Řetězec autorství  Původní poskytovatel licence prohlašuje, že je majitelem autorských práv k původnímu dílu, jež jsou předmětem této licence, nebo že mu k nim byla udělena licence a že má pravomoc a oprávnění licenci udělit. Každý přispěvatel prohlašuje, že je majitelem autorských práv k úpravám, kterými dílo mění, nebo že mu k nim byla udělena licence a že má pravomoc a oprávnění licenci udělit. Kdykoli přijmete licenci, původní poskytovatel licence a následní přispěvatelé Vám udílejí licenci ke svým příspěvkům k dílu podle podmínek této licence.  ## 7. Vyloučení záruky  Dílo se chápe jako dílo, které se stále vyvíjí a které četní přispěvatelé průběžně zdokonalují. Nejedná se o hotové dílo, a může proto obsahovat vady či chyby v programu, které se při takovémto způsobu vývoje běžně vyskytují. Z uvedeného důvodu se dílo podle licence poskytuje v podobě tak, jak je, a bez jakýchkoli záruk k dílu, včetně, mimo jiné, obchodovatelnosti, vhodnosti pro konkrétní účel, bezchybnosti a nechybovosti, přesnosti, neporušení práv duševního vlastnictví vyjma práva autorského, jak je uvedeno v článku 6 této licence. Toto odmítnutí záruky je nedílnou součástí licence a podmínkou pro udělení jakýchkoli práv k dílu.  ## 8. Vyloučení odpovědnosti  S výjimkou případů úmyslného pochybení nebo škod přímo způsobených fyzickým osobám nenese poskytovatel licence v žádném případě odpovědnost za jakékoli přímé nebo nepřímé škody, hmotnou nebo mravní újmu či jakékoli jiné škody vyplývající z licence nebo použití díla, včetně škod způsobených ztrátou dobré pověsti, přerušením práce, poruchou nebo nesprávným fungováním počítače, ztrátou dat nebo jakýchkoli škod komerční povahy, a to i tehdy, pokud poskytovatel licence byl na možnost takové škody upozorněn. Poskytovatel licence však ponese odpovědnost podle zákonů týkajících se odpovědnosti za škodu způsobenou vadou výrobku v míře, v jaké se takové zákony na dané dílo vztahují.  ## 9. Dodatečné dohody  Při rozšiřování díla se můžete rozhodnout uzavřít dodatečné dohody, v nichž se vymezí povinnosti nebo služby v souladu s touto licencí. Pokud však na sebe vezmete závazky, můžete jednat pouze vlastním jménem a výhradně na vlastní odpovědnost, nikoli jménem původního poskytovatele licence či jakéhokoli dalšího přispěvatele, a pouze pokud souhlasíte s tím, že každého přispěvatele odškodníte, budete hájit a uchráníte před škodou nebo uplatňovanými nároky, pokud jde o jakoukoli odpovědnost vzniklou uvedenému přispěvateli v důsledku skutečnosti, že jste přijali záruku nebo dodatečnou odpovědnost.  ## 10. Přijetí licence  S ustanoveními této licence lze vyjádřit souhlas kliknutím na ikonu „Souhlasím“ („I agree“) umístěnou pod oknem, kde je zobrazeno znění této licence, nebo vyjádřením souhlasu obdobným způsobem podle rozhodného práva. Kliknutím na uvedenou ikonu vyjadřujete zřejmý a neodvolatelný souhlas s touto licencí a veškerými jejími podmínkami. Obdobně tuto licenci a veškeré její podmínky neodvolatelně přijímáte, pokud vykonáváte práva, která jsou Vám poskytnuta v souladu s článkem 2 této licence, např. pokud dílo užíváte, vytváříte odvozené dílo nebo dílo nebo jeho kopie šíříte nebo sdělujete.  ## 11. Informování veřejnosti  Pokud dílo šíříte nebo sdělujete prostřednictvím elektronické komunikace (např. nabízíte stažení díla ze vzdáleného umístění), musí příslušný distribuční kanál nebo média (např. internetové stránky) uvádět alespoň takové informace určené veřejnosti, které jsou požadovány rozhodným právem ohledně poskytovatele licence, licence samotné a způsobu jejího zpřístupnění, uzavření, uchovávání a reprodukování nabyvatelem licence.  ## 12. Zánik licence  Platnost licence a práv touto licencí udělených bez dalšího zaniká, pokud nabyvatel licence poruší jakýmkoli způsobem podmínky licence. Uvedeným zánikem není ukončena licence jakékoli osoby, která podle licence dílo obdržela od nabyvatele licence, za podmínky, že takové osoby nadále plně jednají v souladu s podmínkami licence.  ## 13. Různé  Aniž je dotčen výše uvedený článek 9, představuje licence úplnou dohodu mezi stranami, pokud jde o dílo. Je-li podle rozhodného práva jakékoli ustanovení této licence neplatné nebo nevymahatelné, neovlivní tato skutečnost platnost nebo vymahatelnost licence jako celku. Takové ustanovení se vyloží nebo podle potřeby upraví tak, aby bylo platné a vymahatelné. Evropská komise může v požadované a přiměřené míře zveřejnit další jazykové verze nebo nové verze této licence nebo aktualizované verze dodatku, aniž by omezila rozsah práv udělených licencí. Novým verzím bude při zveřejnění přiděleno jedinečné číslo verze. Všechny jazykové verze této licence schválené Evropskou komisí mají stejnou platnost. Strany mohou využít jazykové verze dle svého výběru.  ## 14. Soudní příslušnost  Aniž jsou dotčeny zvláštní dohody mezi stranami,  * soudní spor, který by popřípadě vyplynul z výkladu této licence mezi stranami, se bude řídit výlučnou pravomocí příslušného soudu, kde má poskytovatel licence bydliště nebo vykonává hlavní obchodní činnost.  ## 15. Rozhodné právo  Aniž jsou dotčeny zvláštní dohody mezi stranami,  * tato licence se řídí právem České republiky ",
            "maintainer": "",
            "maintainer_email": "",
            "name": "sysnet-shopping",
            "package_url": "https://pypi.org/project/sysnet-shopping/",
            "platform": null,
            "project_url": "https://pypi.org/project/sysnet-shopping/",
            "project_urls": {
                "Homepage": "https://github.com/SYSNET-CZ/mining/tree/main/shopping"
            },
            "release_url": "https://pypi.org/project/sysnet-shopping/1.0.4/",
            "requires_dist": null,
            "requires_python": ">=3.7",
            "summary": "Data mining shopping portals",
            "version": "1.0.4",
            "yanked": false,
            "yanked_reason": null
        },
        "last_serial": 16072380,
        "urls": [
            {
                "comment_text": "",
                "digests": {
                    "md5": "11f066a13a54f6a9487763b4c4d9f1e2",
                    "sha256": "a77ceda6ca61a4259efa09047d7b146fa35e32d2c33ed8958934976bd02d39ac"
                },
                "downloads": -1,
                "filename": "sysnet_shopping-1.0.4-py3-none-any.whl",
                "has_sig": false,
                "md5_digest": "11f066a13a54f6a9487763b4c4d9f1e2",
                "packagetype": "bdist_wheel",
                "python_version": "py3",
                "requires_python": ">=3.7",
                "size": 23702,
                "upload_time": "2022-12-11T18:48:41",
                "upload_time_iso_8601": "2022-12-11T18:48:41.486190Z",
                "url": "https://files.pythonhosted.org/packages/cc/3d/a5e95678c18d804b879d1c59d62af6f83198ae5bfc45ee34599bbd405c16/sysnet_shopping-1.0.4-py3-none-any.whl",
                "yanked": false,
                "yanked_reason": null
            },
            {
                "comment_text": "",
                "digests": {
                    "md5": "48f5c102b22e57721e7ae7a6d6cd1364",
                    "sha256": "f062867c60ba95028adb563335e18ab43547628a2995267ad8b5d2cd0ebd9d8c"
                },
                "downloads": -1,
                "filename": "sysnet-shopping-1.0.4.tar.gz",
                "has_sig": false,
                "md5_digest": "48f5c102b22e57721e7ae7a6d6cd1364",
                "packagetype": "sdist",
                "python_version": "source",
                "requires_python": ">=3.7",
                "size": 23517,
                "upload_time": "2022-12-11T18:48:43",
                "upload_time_iso_8601": "2022-12-11T18:48:43.969008Z",
                "url": "https://files.pythonhosted.org/packages/63/5d/8dd7aebb41089b6f4427e8a1075853bf1cd3e06579a3ab74f0ebbf0428d0/sysnet-shopping-1.0.4.tar.gz",
                "yanked": false,
                "yanked_reason": null
            }
        ],
        "vulnerabilities": []
    },
    "1.0.5": {
        "info": {
            "author": "",
            "author_email": "Data Miner <info@sysnet.cz>",
            "bugtrack_url": null,
            "classifiers": [
                "License :: Free For Home Use",
                "Operating System :: OS Independent",
                "Programming Language :: Python :: 3",
                "Topic :: Database :: Front-Ends"
            ],
            "description": "# SHOPPING\r\n\r\nTento balíček obsahuje procedury pro vytěžování nákupních portálů.\r\nUmožňuje získávát a analyzovat obchodní/interní informace poblikované na inzertních a nákupních portálech a v sociálních\r\nsítích.\r\nTyto informace jsou následně obohaceny o územně identifikační údaje a analyticky zpracovány nad prohledávacím strojem\r\nelasticseach.\r\n\r\n## Požadavky\r\n\r\nPython 3.9+\r\n\r\n## Instalace a použití\r\n### pip install sysnet-shopping\r\n\r\n(pokud potřebujete ke spuštění  `pip` with oprávnění rool: `sudo pip install sysnet-shopping`)\r\n\r\nPak importujte balíček:\r\n\r\n```python\r\nimport shopping\r\n```\r\n\r\n### Setuptools\r\n\r\nInstalace via [Setuptools](http://pypi.python.org/pypi/setuptools).\r\n\r\n```sh\r\npython setup.py install --user sysnet-shopping\r\n```\r\n(nebo `sudo python setup.py install sysnet-shopping` pro instalaci balíčku pro všechny uživatele)\r\n\r\nA import balíčku:\r\n\r\n```python\r\nimport shopping\r\n```\r\n",
            "description_content_type": "text/markdown",
            "docs_url": null,
            "download_url": "",
            "downloads": {
                "last_day": -1,
                "last_month": -1,
                "last_week": -1
            },
            "home_page": "",
            "keywords": "",
            "license": "# LICENCE PRO DOMÁCÍ POUŽITÍ (SYSNET Home Use License) v 1.0  ## SHUL © SYSNET s.r.o. 2022  <h4 style=\"text-align: center;\">Tato komerční licence SYSNET s.r.o. se vztahuje na dílo (ve smyslu níže uvedených definic), které se poskytuje podle podmínek této licence. Použití díla v rozporu s touto licencí je zakázáno (v míře, v jaké se na uvedené použití vztahuje právo držitele autorských práv k dílu). Dílo se poskytuje podle podmínek této licence, pokud poskytovatel licence (ve smyslu níže uvedených definic) bezprostředně za doložku o autorských právech k dílu umístil toto upozornění: Na toto dílo se vztahuje licence SHUL nebo jakýmkoli jiným způsobem vyjádřil úmysl, aby se dílo poskytovalo podle licence SHUL. </h4>  ## 1. Definice  V rámci této licence mají následující výrazy tento význam:  * „Licencí“ se rozumí tato licence. * „Původním dílem“ se rozumí dílo nebo software šířené nebo sdělené poskytovatelem licence podle této licence, dostupné jako zdrojový kód anebo též jako spustitelný kód. * „Odvozenými díly“ se rozumí díla nebo software, které by nabyvatel licence mohl vytvořit na základě původního díla nebo jeho úprav. V této licenci není definováno, jaká musí být míra úprav nebo závislosti na původním díle, aby bylo považováno za odvozené dílo; tuto míru určuje autorské právo použitelné v zemi podle článku 15. * „Dílem“ se rozumí původní dílo nebo díla z něj odvozená. * „Zdrojovým kódem“ se rozumí podoba díla čitelná pro člověka, kterou mohou lidé nejpohodlněji analyzovat a upravovat. * „Spustitelným kódem“ se rozumí takový kód, který byl obecně sestaven a jenž má být interpretován počítačem jako program. * „Poskytovatelem licence“ se rozumí fyzická nebo právnická osoba, která dílo podle licence šíří nebo sděluje. * „Přispěvatelem“ se rozumí fyzická nebo právnická osoba, jež dílo podle licence upraví nebo jinak přispěje k vytvoření odvozeného díla. * „Nabyvatelem licence“ nebo „Vámi“ se rozumí fyzická nebo právnická osoba, která používá dílo podle podmínek licence. * „Šířením“ nebo „sdělováním“ se rozumí prodej, předání, zapůjčení, pronájem, šíření, sdělování, přenos nebo jiný způsob zpřístupnění kopií díla nebo zpřístupnění jeho podstatných funkcí jakékoli fyzické nebo právnické osobě, a to online nebo offline.  ## 2. Rozsah práv udělených licencí  Poskytovatel licence Vám tímto po dobu trvání autorských práv k původnímu dílu udílí celosvětovou, bezúplatnou, nevýhradní licenci bez možnosti poskytování podlicence, k těmto činnostem:  * používání díla pro soukromé domácí účely a pro nekomerční použití, * rozmnožování díla v rámci domácnosti, * úpravě díla a vytvoření odvozených děl na základě díla v rámci domácnosti a pro nekomerční použití,  Uvedená práva lze uplatnit na všechna média, nosiče a formáty, které jsou v současnosti známé nebo budou v budoucnu vynalezeny, do té míry, do jaké to připouští rozhodné právo. V zemích, kde se uplatňují osobnostní práva, se poskytovatel licence vzdává práva vykonávat své osobnostní právo v rozsahu, v jakém to rozhodné právo umožňuje, aby tak byl umožněn účinný výkon majetkových práv výše uvedených. Poskytovatel licence v míře nezbytné k využívání práv udělených k dílu podle této licence udílí nabyvateli licence bezúplatná, nevýlučná práva na využití případných patentů náležejících poskytovateli licence.  ## 3. Sdělování zdrojového kódu  Poskytovatel licence může poskytnout dílo buď v podobě zdrojového kódu, nebo jako spustitelný kód. Pokud se dílo poskytuje v podobě spustitelného kódu, poskytovatel licence navíc společně s každou kopií díla, kterou šíří nebo na ni odkazuje, poskytne strojově čitelné vyhotovení zdrojového kódu díla; může též v závěru doložky o autorských plánech odkázat na umístění, kde se po dobu, kdy poskytovatel licence šíří nebo sděluje dílo, nachází snadno a volně dostupný zdrojový kód.  ## 4. Omezení autorských práv  Žádným ustanovením této licence nemůže být nabyvatel licence zbaven výhod z případných výjimek z výlučných práv majitelů práv k dílu nebo případného omezení těchto výlučných práv, nebo z vyčerpání uvedených práv nebo z jiných relevantních omezení vztahujících se k takovým právům.  ## 5. Závazky nabyvatele licence  Udělení uvedených práv podléhá určitým omezením a závazkům vůči nabyvateli licence. Jedná se o tyto závazky:  * **Právo na označení**: Nabyvatel licence zachová beze změny veškerá oznámení týkající se autorských práv, patentů či ochranných známek a veškerá oznámení odkazující na licenci a na vyloučení záruk. Kopii takových oznámení a kopii licence musí nabyvatel licence připojit ke každé kopii díla, kterou šíří nebo sděluje. Nabyvatel licence musí zajistit, aby odvozené dílo bylo opatřeno výrazným oznámením, že původní dílo bylo upraveno, a též datem úpravy.  * **Ustanovení o nezměnitelnosti podmínek** (tzv. copyleft clause): Pokud nabyvatel licence šíří nebo sděluje kopie původních děl nebo odvozených děl, uvedené šíření nebo sdělování bude probíhat podle podmínek této licence nebo podle pozdější verze této licence, není-li původní dílo výslovně šířeno pouze pod touto verzí licence – např. označením „výlučně SHUL v. 1.0“. Nabyvatel licence (který se stává poskytovatelem licence) nemůže v souvislosti s dílem nebo odvozeným dílem nabízet nebo ukládat žádné dodatečné podmínky, které by měnily nebo omezovaly podmínky licence.  * **Poskytování zdrojového kódu**: Při šíření nebo sdělování kopií díla nabyvatel licence poskytne strojově čitelné znění zdrojového kódu nebo odkáže na umístění, kde po dobu, kdy nabyvatel licence pokračuje v šíření nebo sdělování díla, je uvedený zdrojový kód snadno a volně přístupný.  * **Právní ochrana**: Touto licencí se nepovoluje použít obchodní názvy, ochranné známky pro výrobky a služby nebo názvy poskytovatele licence, s výjimkou případů, kdy tento požadavek vzniká s ohledem na přiměřené a obvyklé použití při popisu původu díla a při reprodukci obsahu doložky o autorských právech.  ## 6. Řetězec autorství  Původní poskytovatel licence prohlašuje, že je majitelem autorských práv k původnímu dílu, jež jsou předmětem této licence, nebo že mu k nim byla udělena licence a že má pravomoc a oprávnění licenci udělit. Každý přispěvatel prohlašuje, že je majitelem autorských práv k úpravám, kterými dílo mění, nebo že mu k nim byla udělena licence a že má pravomoc a oprávnění licenci udělit. Kdykoli přijmete licenci, původní poskytovatel licence a následní přispěvatelé Vám udílejí licenci ke svým příspěvkům k dílu podle podmínek této licence.  ## 7. Vyloučení záruky  Dílo se chápe jako dílo, které se stále vyvíjí a které četní přispěvatelé průběžně zdokonalují. Nejedná se o hotové dílo, a může proto obsahovat vady či chyby v programu, které se při takovémto způsobu vývoje běžně vyskytují. Z uvedeného důvodu se dílo podle licence poskytuje v podobě tak, jak je, a bez jakýchkoli záruk k dílu, včetně, mimo jiné, obchodovatelnosti, vhodnosti pro konkrétní účel, bezchybnosti a nechybovosti, přesnosti, neporušení práv duševního vlastnictví vyjma práva autorského, jak je uvedeno v článku 6 této licence. Toto odmítnutí záruky je nedílnou součástí licence a podmínkou pro udělení jakýchkoli práv k dílu.  ## 8. Vyloučení odpovědnosti  S výjimkou případů úmyslného pochybení nebo škod přímo způsobených fyzickým osobám nenese poskytovatel licence v žádném případě odpovědnost za jakékoli přímé nebo nepřímé škody, hmotnou nebo mravní újmu či jakékoli jiné škody vyplývající z licence nebo použití díla, včetně škod způsobených ztrátou dobré pověsti, přerušením práce, poruchou nebo nesprávným fungováním počítače, ztrátou dat nebo jakýchkoli škod komerční povahy, a to i tehdy, pokud poskytovatel licence byl na možnost takové škody upozorněn. Poskytovatel licence však ponese odpovědnost podle zákonů týkajících se odpovědnosti za škodu způsobenou vadou výrobku v míře, v jaké se takové zákony na dané dílo vztahují.  ## 9. Dodatečné dohody  Při rozšiřování díla se můžete rozhodnout uzavřít dodatečné dohody, v nichž se vymezí povinnosti nebo služby v souladu s touto licencí. Pokud však na sebe vezmete závazky, můžete jednat pouze vlastním jménem a výhradně na vlastní odpovědnost, nikoli jménem původního poskytovatele licence či jakéhokoli dalšího přispěvatele, a pouze pokud souhlasíte s tím, že každého přispěvatele odškodníte, budete hájit a uchráníte před škodou nebo uplatňovanými nároky, pokud jde o jakoukoli odpovědnost vzniklou uvedenému přispěvateli v důsledku skutečnosti, že jste přijali záruku nebo dodatečnou odpovědnost.  ## 10. Přijetí licence  S ustanoveními této licence lze vyjádřit souhlas kliknutím na ikonu „Souhlasím“ („I agree“) umístěnou pod oknem, kde je zobrazeno znění této licence, nebo vyjádřením souhlasu obdobným způsobem podle rozhodného práva. Kliknutím na uvedenou ikonu vyjadřujete zřejmý a neodvolatelný souhlas s touto licencí a veškerými jejími podmínkami. Obdobně tuto licenci a veškeré její podmínky neodvolatelně přijímáte, pokud vykonáváte práva, která jsou Vám poskytnuta v souladu s článkem 2 této licence, např. pokud dílo užíváte, vytváříte odvozené dílo nebo dílo nebo jeho kopie šíříte nebo sdělujete.  ## 11. Informování veřejnosti  Pokud dílo šíříte nebo sdělujete prostřednictvím elektronické komunikace (např. nabízíte stažení díla ze vzdáleného umístění), musí příslušný distribuční kanál nebo média (např. internetové stránky) uvádět alespoň takové informace určené veřejnosti, které jsou požadovány rozhodným právem ohledně poskytovatele licence, licence samotné a způsobu jejího zpřístupnění, uzavření, uchovávání a reprodukování nabyvatelem licence.  ## 12. Zánik licence  Platnost licence a práv touto licencí udělených bez dalšího zaniká, pokud nabyvatel licence poruší jakýmkoli způsobem podmínky licence. Uvedeným zánikem není ukončena licence jakékoli osoby, která podle licence dílo obdržela od nabyvatele licence, za podmínky, že takové osoby nadále plně jednají v souladu s podmínkami licence.  ## 13. Různé  Aniž je dotčen výše uvedený článek 9, představuje licence úplnou dohodu mezi stranami, pokud jde o dílo. Je-li podle rozhodného práva jakékoli ustanovení této licence neplatné nebo nevymahatelné, neovlivní tato skutečnost platnost nebo vymahatelnost licence jako celku. Takové ustanovení se vyloží nebo podle potřeby upraví tak, aby bylo platné a vymahatelné. Evropská komise může v požadované a přiměřené míře zveřejnit další jazykové verze nebo nové verze této licence nebo aktualizované verze dodatku, aniž by omezila rozsah práv udělených licencí. Novým verzím bude při zveřejnění přiděleno jedinečné číslo verze. Všechny jazykové verze této licence schválené Evropskou komisí mají stejnou platnost. Strany mohou využít jazykové verze dle svého výběru.  ## 14. Soudní příslušnost  Aniž jsou dotčeny zvláštní dohody mezi stranami,  * soudní spor, který by popřípadě vyplynul z výkladu této licence mezi stranami, se bude řídit výlučnou pravomocí příslušného soudu, kde má poskytovatel licence bydliště nebo vykonává hlavní obchodní činnost.  ## 15. Rozhodné právo  Aniž jsou dotčeny zvláštní dohody mezi stranami,  * tato licence se řídí právem České republiky ",
            "maintainer": "",
            "maintainer_email": "",
            "name": "sysnet-shopping",
            "package_url": "https://pypi.org/project/sysnet-shopping/",
            "platform": null,
            "project_url": "https://pypi.org/project/sysnet-shopping/",
            "project_urls": {
                "Homepage": "https://github.com/SYSNET-CZ/mining/tree/main/shopping"
            },
            "release_url": "https://pypi.org/project/sysnet-shopping/1.0.5/",
            "requires_dist": null,
            "requires_python": ">=3.7",
            "summary": "Data mining shopping portals",
            "version": "1.0.5",
            "yanked": false,
            "yanked_reason": null
        },
        "last_serial": 16072380,
        "urls": [
            {
                "comment_text": "",
                "digests": {
                    "md5": "a827dde9ec5179a550e95feb8cdaa259",
                    "sha256": "9cbb6e7aea2c6fe58f94ad73bb112a477cdec16a7380948921646eedb7e22725"
                },
                "downloads": -1,
                "filename": "sysnet_shopping-1.0.5-py3-none-any.whl",
                "has_sig": false,
                "md5_digest": "a827dde9ec5179a550e95feb8cdaa259",
                "packagetype": "bdist_wheel",
                "python_version": "py3",
                "requires_python": ">=3.7",
                "size": 23672,
                "upload_time": "2022-12-12T10:11:47",
                "upload_time_iso_8601": "2022-12-12T10:11:47.577902Z",
                "url": "https://files.pythonhosted.org/packages/bd/12/abbefed08d1618e0d2780cbf3db907f12e83f11ba104711162571a53d7e3/sysnet_shopping-1.0.5-py3-none-any.whl",
                "yanked": false,
                "yanked_reason": null
            },
            {
                "comment_text": "",
                "digests": {
                    "md5": "4c8e47f27107424ce94e003cbbba54d7",
                    "sha256": "d8a68e44687d6bf4807bee5fef1c68b6ff7d3fb231893fd4d33bf5c01927ab02"
                },
                "downloads": -1,
                "filename": "sysnet-shopping-1.0.5.tar.gz",
                "has_sig": false,
                "md5_digest": "4c8e47f27107424ce94e003cbbba54d7",
                "packagetype": "sdist",
                "python_version": "source",
                "requires_python": ">=3.7",
                "size": 23513,
                "upload_time": "2022-12-12T10:11:49",
                "upload_time_iso_8601": "2022-12-12T10:11:49.899949Z",
                "url": "https://files.pythonhosted.org/packages/74/5f/dbac17d13d9fd3f041c8de5d4027f1f9bd40c1b0e5664d2d10249b5a40ae/sysnet-shopping-1.0.5.tar.gz",
                "yanked": false,
                "yanked_reason": null
            }
        ],
        "vulnerabilities": []
    }
}