{
    "1.0.1": {
        "info": {
            "author": "Evangelos (Angel) Chatzaroulas",
            "author_email": "e.chatzaroulas@surrey.ac.uk",
            "bugtrack_url": null,
            "classifiers": [
                "Environment :: Console",
                "Intended Audience :: Science/Research",
                "License :: OSI Approved :: MIT License",
                "Programming Language :: Python :: 3.7",
                "Topic :: Scientific/Engineering :: Artificial Intelligence"
            ],
            "description": "# gym-PBN\nAn OpenAI Gym environment modelling Probabilistic Boolean Networks and Probabilistic Boolean Control Networks.\n\nProbabilistic Boolean (Control) Networks are Boolean Networks where the logic functions for each node are switched stochastically according to a probability distribution. They were introduced by [Shmulevich, Ilya, et al., 2002](https://academic.oup.com/bioinformatics/article/18/2/261/225574?login=true) and are used primarily to model Gene Regulatory Networks. As such, their control has applications in theuraputics, and specifically cancer treatment.\n\nThe control of Probabilistic Boolean (Control) Networks is a well studied problem in control theory. Recently, however, there has been promise on the application of Reinforcement Learning for control of said networks to certain attractor states as well [Papagiannis, Georgios, et al., 2019](https://arxiv.org/abs/1909.03331).\n\nThe point of this library is to provide accessible PB(C)N environments in the OpenAI Gym framework. The environments provided are fully [Stable Baselines3](https://github.com/DLR-RM/stable-baselines3)-compatible\n\n## Environments\n- `gym_PBN:PBN-v0`: The base Probabilistic Boolean Network environment. Actions involve taking no action, or \"flipping\" the value of a node at the provided index.\n- `gym_PBN:PBCN-v0`: The base Probabilistic Boolean Control Network environment. Actions involve setting the control nodes to a certain value.\n\nThe environments provide the framework for such networks. They need to be instantiated with appropriate node data.\n\n## Installation\nRequirements: [Python 3.6+](https://www.python.org/downloads/).\n\nPIP: `python -m pip install gym-PBN`\n\nAnaconda: **TO BE UPDATED**\n\n## Configuring your own PB(C)N\nCustom network environments need to be parameterised with one of the following two configurations:\n1. `PBN_data`: list of tuples containing node information.\n    - Each tuple should contain the following five variables, in order:\n      1. `input_mask`: a boolean mask as a numpy array that indicates which nodes affect the node's value.\n      2. `function`: a truth table representing a boolean function over the nodes singled out by the `input_mask`. The truth table should have a tree-like shape of `[2] * sum(input_mask)`, and the item at position `pos` should indicate the probability of the node taking the value `True` given `pos` as the state of the input nodes (which are singled out by `input_mask`.\n      3. `i`: the position of the node in the network's list of vertices.\n      4. `name`: string representing the name of the node. Could be `None`.\n      5. `is_control`: boolean flag on whether or not this is a control node (for PBCNs).\n\n2. `logic_func_data`: Think setting all the previous information manually is a pain? We do too, so this is the more sane configuration option. Through `logic_func_data`, you can pass in just the names of the nodes, and the associated logic functions (with their probability of activating) and the constructor will do the rest.\n    - `logic_func_data` is a tuple. The tuple contains:\n      1. `node_names`: a list of string literals representing each node in the network. Make sure to put control nodes at the start of the list.\n      2. `logic_funcs`: a list of logic functions for each node. Each inner list (associated with the node in the corresponding position in the node names) contains tuples describing logic functions and probabilities of activating for this node. This is modelled as follows:\n        1. `logic_expr`: the logic expression representing the logic function for the tuple. You can use literals that appear in the `node_names` list and Python boolean operators `and`, `not`, `or`.\n        2. `probability`: a float representing the probability of this function activating.\n   \n   You can view an example of this second configuration over at [example.py](example.py).\n\n#### Goal Configuration\nAnother thing you can configure for your own network is the actual control target. When not provided explicitly, the environment calculates the attractors for the environment and selects the last one as the target. However, especially for PBCNs, we encourage you to provide it explicitly. To do so, provide a `goal_config` argument to the environment instantiation, with the following information:\n\n1. `\"all_attractors\"`: list of all the attractors present in the PB(C)N. This should be a list of sets. Each set should contain tuples that represent the attractor states if it's a cyclic attractor, or a single tuple representing the equilibruim point if it's a single-state attractor.\n2. `\"target\"`: the target attractor, out of the list of attractors. Naturally this is a set of tuples, or just one tuple in the equilibrium point case.\n\n#### Reward Configuration\nThe final thing you can configure without modifying the environment is the actual reward (and cost) values for the reward function. Simply provide a `reward_config` argument to the environment instatiation, with the following information:\n\n1. `\"successful_reward\"`: integer reward given for actions that transition into the target attractor. Defaults to `5`. Recommended: `> 2`.\n2. `\"wrong_attractor_cost\"`: integer cost associated to actions that transition into an undesired attractor. Defaults to `2`. This is applied for every attractor that the new state hits (sometimes it's multiple).\n3. `\"action_cost\"`: integer cost associated to actions being taken. Defaults to `1`, to discourage the agent from intervening too often.\n\n\n## Credits\nThe majority of the work for the implementation of Probabilistic Boolean Networks in Python can be attributed to [Vytenis Šliogeris](https://github.com/vjsliogeris) and his [PBN_env](https://github.com/vjsliogeris/PBN_env) package. In fact he implemented the prototype version of `gym-PBN` some time ago.\n\n[Evangelos Chatzaroulas](mailto:e.chatzaroulas@surrey.ac.uk) finished the adaptation to the OpenAI Gym framework and implemented PB(C)N support. He is currently the primary maintainer.\n\n\n",
            "description_content_type": "text/markdown",
            "docs_url": null,
            "download_url": "",
            "downloads": {
                "last_day": -1,
                "last_month": -1,
                "last_week": -1
            },
            "home_page": "https://github.com/evangelos-ch/gym-PBN/",
            "keywords": "",
            "license": "MIT",
            "maintainer": "",
            "maintainer_email": "",
            "name": "gym-PBN",
            "package_url": "https://pypi.org/project/gym-PBN/",
            "platform": "",
            "project_url": "https://pypi.org/project/gym-PBN/",
            "project_urls": {
                "Homepage": "https://github.com/evangelos-ch/gym-PBN/"
            },
            "release_url": "https://pypi.org/project/gym-PBN/1.0.1/",
            "requires_dist": [
                "gym",
                "networkx",
                "numpy"
            ],
            "requires_python": ">3.6",
            "summary": "An OpenAI Gym modelling Probabilistic Boolean Networks and Probabilistic Boolean Control Networks.",
            "version": "1.0.1",
            "yanked": false,
            "yanked_reason": null
        },
        "last_serial": 11446905,
        "urls": [
            {
                "comment_text": "",
                "digests": {
                    "md5": "0b2a9cc3231ce88785230938c25479c0",
                    "sha256": "9058f60bb518fff4223a44ccb512bf906cd848cc758ef8de71ea05b6745ee113"
                },
                "downloads": -1,
                "filename": "gym_PBN-1.0.1-py3-none-any.whl",
                "has_sig": false,
                "md5_digest": "0b2a9cc3231ce88785230938c25479c0",
                "packagetype": "bdist_wheel",
                "python_version": "py3",
                "requires_python": ">3.6",
                "size": 16422,
                "upload_time": "2021-09-14T12:03:06",
                "upload_time_iso_8601": "2021-09-14T12:03:06.446782Z",
                "url": "https://files.pythonhosted.org/packages/81/c4/2d588ef1f87e7e10bdc3dc566dff6a1717ad6d1150b4271ed26651effe22/gym_PBN-1.0.1-py3-none-any.whl",
                "yanked": false,
                "yanked_reason": null
            },
            {
                "comment_text": "",
                "digests": {
                    "md5": "26a45a93690e53536ed77c5e26317762",
                    "sha256": "f63c8a8d2aa240959719cae572e548d985a0bd2e304a9a8e9ed7c01f972c3232"
                },
                "downloads": -1,
                "filename": "gym-PBN-1.0.1.tar.gz",
                "has_sig": false,
                "md5_digest": "26a45a93690e53536ed77c5e26317762",
                "packagetype": "sdist",
                "python_version": "source",
                "requires_python": ">3.6",
                "size": 15370,
                "upload_time": "2021-09-14T12:03:07",
                "upload_time_iso_8601": "2021-09-14T12:03:07.721615Z",
                "url": "https://files.pythonhosted.org/packages/d6/ac/794570de9cfc542fe250a94b4a0f68bea3a19a007b6b943f55af9627b9fe/gym-PBN-1.0.1.tar.gz",
                "yanked": false,
                "yanked_reason": null
            }
        ],
        "vulnerabilities": []
    }
}